{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": false
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "#": 5,
      "%": 6,
      "(": 7,
      ")": 8,
      "+": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      "=": 23,
      "@": 24,
      "A": 25,
      "B": 26,
      "C": 27,
      "F": 28,
      "H": 29,
      "I": 30,
      "K": 31,
      "L": 32,
      "M": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "R": 37,
      "S": 38,
      "T": 39,
      "X": 40,
      "Z": 41,
      "[": 42,
      "\\": 43,
      "]": 44,
      "a": 45,
      "b": 46,
      "c": 47,
      "e": 48,
      "g": 49,
      "i": 50,
      "l": 51,
      "n": 52,
      "o": 53,
      "p": 54,
      "r": 55,
      "s": 56,
      "t": 57,
      "##O": 58,
      "##C": 59,
      "##1": 60,
      "##c": 61,
      "##4": 62,
      "##5": 63,
      "##n": 64,
      "##N": 65,
      "##2": 66,
      "##l": 67,
      "##o": 68,
      "##3": 69,
      "##S": 70,
      "##0": 71,
      "##9": 72,
      "##s": 73,
      "##6": 74,
      "##P": 75,
      "##8": 76,
      "##F": 77,
      "##r": 78,
      "##7": 79,
      "##B": 80,
      "##I": 81,
      "##H": 82,
      "##e": 83,
      "##i": 84,
      "##R": 85,
      "##a": 86,
      "##K": 87,
      "##X": 88,
      "##b": 89,
      "##g": 90,
      "##p": 91,
      "##T": 92,
      "##cc": 93,
      "##CC": 94,
      "##ccc": 95,
      "##c1": 96,
      "CC": 97,
      "##c2": 98,
      "c1": 99,
      "c2": 100,
      "##ccccc": 101,
      "##c3": 102,
      "NC": 103,
      "cc1": 104,
      "CO": 105,
      "c3": 106,
      "##CCC": 107,
      "##c1ccc": 108,
      "OC": 109,
      "##nc": 110,
      "Cl": 111,
      "##cccc": 112,
      "##CCN": 113,
      "##ccccc2": 114,
      "##ccccc1": 115,
      "CN": 116,
      "cc2": 117,
      "##CCCC": 118,
      "C1": 119,
      "Cc1": 120,
      "c1ccc": 121,
      "nH": 122,
      "c2ccc": 123,
      "##n1": 124,
      "##OC": 125,
      "##ccccc3": 126,
      "C2": 127,
      "CCC": 128,
      "CC1": 129,
      "cc": 130,
      "ccc": 131,
      "##c2ccc": 132,
      "c4": 133,
      "c2ccccc2": 134,
      "cc3": 135,
      "##n2": 136,
      "##c2ccccc2": 137,
      "N1": 138,
      "CCN": 139,
      "##c1cc": 140,
      "COc1ccc": 141,
      "N2": 142,
      "##cn": 143,
      "Cc1ccc": 144,
      "c3ccc": 145,
      "##1C": 146,
      "##c1ccccc1": 147,
      "c1ccccc1": 148,
      "##CCO": 149,
      "CC2": 150,
      "n2": 151,
      "##CCCN": 152,
      "c2cc": 153,
      "n1": 154,
      "##c4": 155,
      "##ncc": 156,
      "1C": 157,
      "##c3ccccc3": 158,
      "c3ccccc3": 159,
      "COC": 160,
      "##2c": 161,
      "##nc2": 162,
      "c1cc": 163,
      "C3": 164,
      "##CCCCC": 165,
      "##c3ccc": 166,
      "Br": 167,
      "##Cl": 168,
      "##c1cccc": 169,
      "##NC": 170,
      "CS": 171,
      "##c2cc": 172,
      "##CC2": 173,
      "##ccccc4": 174,
      "CCCCC": 175,
      "Cc1cc": 176,
      "nc": 177,
      "COc1cc": 178,
      "CCCC": 179,
      "##2C": 180,
      "##n3": 181,
      "c2c": 182,
      "NCC": 183,
      "##c2c": 184,
      "CNC": 185,
      "N3": 186,
      "2C": 187,
      "CCO": 188,
      "Nc1ccc": 189,
      "ccc2": 190,
      "##nn": 191,
      "OCC": 192,
      "c1cccc": 193,
      "CCCN": 194,
      "##c1nc": 195,
      "c1c": 196,
      "CCOC": 197,
      "ccc1": 198,
      "Cc1ccccc1": 199,
      "1O": 200,
      "CC3": 201,
      "c2cccc": 202,
      "##nc3": 203,
      "##CC3": 204,
      "nc2": 205,
      "##CC1": 206,
      "##3c": 207,
      "##nc1": 208,
      "Cn1": 209,
      "##nnc": 210,
      "##c1c": 211,
      "##C1": 212,
      "Cc1c": 213,
      "c3cc": 214,
      "##1CCN": 215,
      "cc4": 216,
      "Nc2": 217,
      "NS": 218,
      "##c3c": 219,
      "cccc": 220,
      "##C2": 221,
      "Nc2ccc": 222,
      "##c3cc": 223,
      "2O": 224,
      "nc1": 225,
      "Cc2ccc": 226,
      "c2c1": 227,
      "c4ccc": 228,
      "1CC": 229,
      "Cc2ccccc2": 230,
      "##s1": 231,
      "n3": 232,
      "##ccccc12": 233,
      "##sc": 234,
      "c5": 235,
      "##CN": 236,
      "ccc3": 237,
      "Cc1cccc": 238,
      "c2nc": 239,
      "C4": 240,
      "c3c": 241,
      "NC1": 242,
      "c4ccccc4": 243,
      "c1C": 244,
      "c3cccc": 245,
      "##oc": 246,
      "OCO": 247,
      "COc1cccc": 248,
      "##c2cccc": 249,
      "##4c": 250,
      "3C": 251,
      "##o1": 252,
      "N2CCN": 253,
      "N1CCC": 254,
      "12": 255,
      "CCCCN": 256,
      "cc1OC": 257,
      "Nc1": 258,
      "N1CCN": 259,
      "CCNC": 260,
      "##CCCCC1": 261,
      "cn1": 262,
      "CN2": 263,
      "C1C": 264,
      "##c4ccccc4": 265,
      "##s2": 266,
      "CN1": 267,
      "##CC4": 268,
      "##3C": 269,
      "nc3": 270,
      "##CCCCC2": 271,
      "##nc4": 272,
      "##c4ccc": 273,
      "NC2": 274,
      "N2C": 275,
      "Nc3ccc": 276,
      "c2n": 277,
      "##ccccc23": 278,
      "SC": 279,
      "COc1ccccc1": 280,
      "##o2": 281,
      "s1": 282,
      "NCCN": 283,
      "cc1C": 284,
      "##c3cccc": 285,
      "3O": 286,
      "N4": 287,
      "N1C": 288,
      "##n1c": 289,
      "Nc1cccc": 290,
      "##CCOCC2": 291,
      "##CCCO": 292,
      "2CC": 293,
      "CCCCCCCCC": 294,
      "NN": 295,
      "c1OC": 296,
      "c2cn": 297,
      "##c2nc": 298,
      "c1ccc2c": 299,
      "c1cn": 300,
      "Nc1cc": 301,
      "##CCCC2": 302,
      "NO": 303,
      "o1": 304,
      "Cc3ccccc3": 305,
      "Nc1nc": 306,
      "Cn2": 307,
      "CCCNC": 308,
      "##c1n": 309,
      "CN1C": 310,
      "##2cc": 311,
      "Cn1c": 312,
      "##CCCC1": 313,
      "c12": 314,
      "##c2c1": 315,
      "Nc1ccccc1": 316,
      "O1": 317,
      "cn2": 318,
      "##2nc": 319,
      "NCCC": 320,
      "N1CC": 321,
      "c2ccccc12": 322,
      "CCOc1ccc": 323,
      "##CCOCC3": 324,
      "1CN": 325,
      "##c5": 326,
      "c1O": 327,
      "c1nc": 328,
      "3CC": 329,
      "O2": 330,
      "##CCCCC3": 331,
      "nn2": 332,
      "Oc1ccc": 333,
      "nn1": 334,
      "N2CCC": 335,
      "##SC": 336,
      "##CCOCC1": 337,
      "##nccc": 338,
      "Cc3ccc": 339,
      "cc12": 340,
      "##ccccc5": 341,
      "cc1Cl": 342,
      "CC4": 343,
      "Cc1nc": 344,
      "ccc1O": 345,
      "##CCNC": 346,
      "##Br": 347,
      "C2C": 348,
      "##n4": 349,
      "ncn": 350,
      "SCC": 351,
      "Nc2cc": 352,
      "Nc2ccccc2": 353,
      "Oc2ccc": 354,
      "CN1CCN": 355,
      "N3CCN": 356,
      "NCc1ccc": 357,
      "##CCCC3": 358,
      "##c1C": 359,
      "cc21": 360,
      "c2ccc3": 361,
      "##2ccccc2": 362,
      "12C": 363,
      "1OC": 364,
      "OCCO": 365,
      "c2ccccc21": 366,
      "##nc2c": 367,
      "CCC1": 368,
      "NC3": 369,
      "##s3": 370,
      "##ncc2": 371,
      "c2ccc3c": 372,
      "o2": 373,
      "C1CC": 374,
      "##N1": 375,
      "c3c2": 376,
      "Cc2c": 377,
      "ncc": 378,
      "NCCCN": 379,
      "##CCC2": 380,
      "N2CC": 381,
      "ccc21": 382,
      "Na": 383,
      "c4cc": 384,
      "##C3": 385,
      "CCS": 386,
      "c1n": 387,
      "CCc1ccc": 388,
      "cccc2": 389,
      "CCN1": 390,
      "Nc2cccc": 391,
      "N2CCOCC2": 392,
      "4C": 393,
      "s2": 394,
      "c3ccccc23": 395,
      "cc1O": 396,
      "##o3": 397,
      "Cc1n": 398,
      "c2C": 399,
      "COc1ccc2c": 400,
      "ccc1C": 401,
      "CCCO": 402,
      "Cn1cc": 403,
      "Nc2nc": 404,
      "##c2ccccc21": 405,
      "NNC": 406,
      "NCCCC": 407,
      "##nnn": 408,
      "cc1F": 409,
      "##cnn": 410,
      "CN3": 411,
      "OCCN": 412,
      "##c3nc": 413,
      "##n1cc": 414,
      "cc2c1": 415,
      "ccc4": 416,
      "COc1cc2c": 417,
      "C1CCN": 418,
      "##c4cc": 419,
      "n4": 420,
      "##12": 421,
      "##ncccc": 422,
      "N3CCOCC3": 423,
      "##ncc3": 424,
      "##n2c": 425,
      "CCCCCC": 426,
      "cn": 427,
      "##cncc": 428,
      "n1C": 429,
      "cc2Cl": 430,
      "OCO3": 431,
      "c2n1": 432,
      "c4cccc": 433,
      "OC1": 434,
      "NCc2ccc": 435,
      "##nc2cc": 436,
      "cn3": 437,
      "Cc2cc": 438,
      "##ccccc34": 439,
      "##2CCN": 440,
      "ccc12": 441,
      "nc2c1": 442,
      "C5": 443,
      "##cnc": 444,
      "C1N": 445,
      "##3ccccc3": 446,
      "##c1nnc": 447,
      "##ncc1": 448,
      "CCN1C": 449,
      "c3nc": 450,
      "cc2C": 451,
      "Nc3ccccc3": 452,
      "##n2C": 453,
      "n2C": 454,
      "##n1C": 455,
      "c2cccnc2": 456,
      "n2cc": 457,
      "1CCCN": 458,
      "OCc1ccccc1": 459,
      "23": 460,
      "CCn1c": 461,
      "Cc2": 462,
      "21": 463,
      "N3CCC": 464,
      "##c4c": 465,
      "##nc3cc": 466,
      "cc5": 467,
      "OCO2": 468,
      "##2c1": 469,
      "2CN": 470,
      "CCCCCCCCCCCCC": 471,
      "n2c": 472,
      "CN2C": 473,
      "nn": 474,
      "Cc2cccc": 475,
      "##1OC": 476,
      "COCC": 477,
      "##c1ncc": 478,
      "c23": 479,
      "no1": 480,
      "##5c": 481,
      "##CCOCC4": 482,
      "cs1": 483,
      "CCC2": 484,
      "cc2F": 485,
      "##CCN1": 486,
      "##nc12": 487,
      "nn3": 488,
      "##c3ccccc32": 489,
      "##nc3c": 490,
      "c1ccc2": 491,
      "cc23": 492,
      "c1cccnc1": 493,
      "C2CC": 494,
      "C2CC2": 495,
      "OCO4": 496,
      "##CCOCCO": 497,
      "Nc3cc": 498,
      "OP": 499,
      "NCc1ccccc1": 500,
      "##2CCC": 501,
      "n2nc": 502,
      "Cc1ccc2c": 503,
      "##N1CCN": 504,
      "##OCC": 505,
      "Oc3ccc": 506,
      "cccc3": 507,
      "OCc2ccccc2": 508,
      "c2cccs2": 509,
      "CCCCCCCC": 510,
      "CN2CCN": 511,
      "CCc1cc": 512,
      "##c2C": 513,
      "c4c": 514,
      "4CC": 515,
      "##O1": 516,
      "COP": 517,
      "##CCCNC": 518,
      "N3C": 519,
      "C2CCN": 520,
      "OCCCC": 521,
      "##c12": 522,
      "1NC": 523,
      "OC2": 524,
      "Nc3": 525,
      "CCc1ccccc1": 526,
      "C3CC3": 527,
      "COc2ccc": 528,
      "Nc1c": 529,
      "##4C": 530,
      "nc12": 531,
      "COc1ccc2": 532,
      "Cc1cn": 533,
      "c2nnc": 534,
      "c1ccco1": 535,
      "c21": 536,
      "c5ccc": 537,
      "c1cccs1": 538,
      "ccc2c1": 539,
      "##c32": 540,
      "COc1c": 541,
      "##CC5": 542,
      "c2ccncc2": 543,
      "##c4cccc": 544,
      "##2ccccc2c1": 545,
      "##4ccccc4": 546,
      "Clc1ccc": 547,
      "##CCC3": 548,
      "c1Cl": 549,
      "##2ccccc12": 550,
      "CCC3": 551,
      "Nc3cccc": 552,
      "c2nn": 553,
      "O3": 554,
      "##CCOC": 555,
      "Nc4ccc": 556,
      "c2ccco2": 557,
      "Cc1nn": 558,
      "##Oc1ccc": 559,
      "CCCCNC": 560,
      "##3cc": 561,
      "1N": 562,
      "C1NC": 563,
      "c1cnc": 564,
      "2OC": 565,
      "N1CCOCC1": 566,
      "##c2ccccc2C": 567,
      "##c2n": 568,
      "cc1NC": 569,
      "ccc23": 570,
      "CCCC2": 571,
      "CCCCCCC": 572,
      "c5ccccc5": 573,
      "4O": 574,
      "Nc1ccc2c": 575,
      "##sccc": 576,
      "c2cnc": 577,
      "c6": 578,
      "##cnc3c": 579,
      "nc4": 580,
      "c3cccnc3": 581,
      "c2ncc": 582,
      "OCCC": 583,
      "CN1CC": 584,
      "c2ccccn2": 585,
      "2C1": 586,
      "Cc4ccccc4": 587,
      "CCn1": 588,
      "cnc2": 589,
      "NCc3ccc": 590,
      "##nc5": 591,
      "C1CCCCC1": 592,
      "5CC": 593,
      "NCCO": 594,
      "Fc1ccc": 595,
      "##1CC": 596,
      "c1cc2c": 597,
      "C1CC1": 598,
      "cc32": 599,
      "C1CCC": 600,
      "c2nc3ccccc3": 601,
      "##nc4ccccc4": 602,
      "##c2nnc": 603,
      "Nc1ncc": 604,
      "CN1CCC": 605,
      "##CCCC4": 606,
      "c3ccc4c": 607,
      "##c1cn": 608,
      "c2cccc3": 609,
      "CCc1c": 610,
      "CSC": 611,
      "N5": 612,
      "N2CCCC2": 613,
      "##CC3CC": 614,
      "OS": 615,
      "##O2": 616,
      "c2ccccc2Cl": 617,
      "N2CCCCC2": 618,
      "cccc1": 619,
      "CCOc1cc": 620,
      "c2cc3c": 621,
      "##N1C": 622,
      "c3ccccc32": 623,
      "c3ccco3": 624,
      "##c3c2": 625,
      "Cn2c": 626,
      "##CCCCC4": 627,
      "##CCN1C": 628,
      "N3CC": 629,
      "c2csc": 630,
      "ccc1OC": 631,
      "##2C1": 632,
      "CCCC3": 633,
      "Nc1n": 634,
      "2CCCN": 635,
      "cs2": 636,
      "oc2c1": 637,
      "##3CCN": 638,
      "C2CCCCC2": 639,
      "CC1C": 640,
      "c3ccncc3": 641,
      "NC4": 642,
      "cc3F": 643,
      "nc21": 644,
      "c3cccs3": 645,
      "Cc1cnc": 646,
      "ncnc32": 647,
      "1CCCN1C": 648,
      "Nc2c": 649,
      "c2ccccc2C": 650,
      "##N2": 651,
      "Oc1ccccc1": 652,
      "OCc3ccccc3": 653,
      "##n3c": 654,
      "NCc2ccccc2": 655,
      "cccc1C": 656,
      "sc2": 657,
      "43C": 658,
      "c4ccccc34": 659,
      "Cc4ccc": 660,
      "no2": 661,
      "##2ccc": 662,
      "c3ccccn3": 663,
      "cc1N": 664,
      "##sc2": 665,
      "1CO": 666,
      "sc2c1": 667,
      "Cc3cccc": 668,
      "##1CCC": 669,
      "##SCC": 670,
      "Oc2ccccc2": 671,
      "21C": 672,
      "1CCC": 673,
      "32": 674,
      "c1F": 675,
      "c1ccccc1C": 676,
      "ccn1": 677,
      "c1ccncc1": 678,
      "n1c": 679,
      "NCC2": 680,
      "n1cc": 681,
      "OCCCN": 682,
      "no": 683,
      "CN2CCC": 684,
      "CCN1CCN": 685,
      "c3C": 686,
      "C1O": 687,
      "##c5ccccc5": 688,
      "N4CCOCC4": 689,
      "C3C": 690,
      "CCCl": 691,
      "##1O": 692,
      "CNS": 693,
      "FC": 694,
      "Oc1cc": 695,
      "Oc2cc": 696,
      "c2c1C": 697,
      "N1CCCC1": 698,
      "COc1ccccc1C": 699,
      "CCc2ccccc2": 700,
      "N2CCCC": 701,
      "cc3Cl": 702,
      "12CC": 703,
      "c1ncc": 704,
      "n3cc": 705,
      "c1ccccn1": 706,
      "CCCCC1": 707,
      "##c1ncn2": 708,
      "N1CCCC": 709,
      "##c1ccc2c": 710,
      "nc2c": 711,
      "cc2c": 712,
      "N4CCN": 713,
      "N3CCCC3": 714,
      "CC5": 715,
      "nnc1": 716,
      "6O": 717,
      "oc2cc": 718,
      "##sc1": 719,
      "Cc1noc": 720,
      "##c1nc2ccccc2": 721,
      "c1ccccc1Cl": 722,
      "CCCC1": 723,
      "C1CCCN": 724,
      "Cn2cc": 725,
      "##c5ccc": 726,
      "OCc2ccc": 727,
      "n2cnc3c": 728,
      "##n3C": 729,
      "s3": 730,
      "c2cc1OC": 731,
      "c3cn": 732,
      "##n2cc": 733,
      "NCC1": 734,
      "nc2cc": 735,
      "ccc32": 736,
      "CCn1cc": 737,
      "##1CN": 738,
      "cc3C": 739,
      "##n12": 740,
      "nc1C": 741,
      "S1": 742,
      "c2ccccc2F": 743,
      "##2CC": 744,
      "OC3": 745,
      "##c21": 746,
      "ccc1Cl": 747,
      "N3CCCCC3": 748,
      "##2CCOCC2": 749,
      "c3n2": 750,
      "cc1S": 751,
      "1CCN": 752,
      "COC1": 753,
      "c1nnc": 754,
      "CCl": 755,
      "c2O": 756,
      "Oc1cccc": 757,
      "Cc3cc": 758,
      "##CCC4": 759,
      "##oc1": 760,
      "##CCCCN": 761,
      "c1NC": 762,
      "Nc2ncc": 763,
      "Nc1ncnc2": 764,
      "n3c": 765,
      "Cn3": 766,
      "CCCS": 767,
      "c1csc": 768,
      "5C": 769,
      "##CCS": 770,
      "C3CCCCC3": 771,
      "CCOc1ccccc1": 772,
      "c1cncc": 773,
      "5O": 774,
      "##2CC3CC": 775,
      "Nc2ccc3c": 776,
      "##c2cn": 777,
      "##c23": 778,
      "Cc3c": 779,
      "2CO": 780,
      "CC1CC": 781,
      "c1nc2ccccc2": 782,
      "##21": 783,
      "##5C": 784,
      "Cc1ccc2": 785,
      "NC1CCCCC1": 786,
      "Oc3ccccc3": 787,
      "##23": 788,
      "on1": 789,
      "c3cnc": 790,
      "##c6": 791,
      "OCC2": 792,
      "c2C1": 793,
      "c1N": 794,
      "##3nc": 795,
      "CCc1": 796,
      "##OC2": 797,
      "ccc1N": 798,
      "##c2ccccc2c1": 799,
      "##1CCOCC1": 800,
      "n2ccc": 801,
      "N1CCCCC1": 802,
      "CSc1ccc": 803,
      "COCCN": 804,
      "##nc2c1": 805,
      "nc32": 806,
      "c1nn": 807,
      "C2CCCN": 808,
      "cc3c2": 809,
      "##nc4cc": 810,
      "##CCC1": 811,
      "C4CC4": 812,
      "##s4": 813,
      "2N": 814,
      "##onc": 815,
      "##oc2": 816,
      "##3CC4": 817,
      "CC1CCCCC1": 818,
      "CN4": 819,
      "cc3c": 820,
      "##scc": 821,
      "##sc3": 822,
      "c2ccnc": 823,
      "##ncc4": 824,
      "c2ccccc2C1": 825,
      "Cc1ncc": 826,
      "cnc1": 827,
      "CCCn1c": 828,
      "Nc1nnc": 829,
      "CCN3": 830,
      "nc3c2": 831,
      "ccc2C": 832,
      "##CCCCCCCC": 833,
      "23C": 834,
      "CSc1nnc": 835,
      "CCCCC2": 836,
      "##o4": 837,
      "3OC": 838,
      "Cc1cc2c": 839,
      "NCc3ccccc3": 840,
      "CNCC": 841,
      "nc2ccccc12": 842,
      "Cc1ccccc1C": 843,
      "cc2C1": 844,
      "cc2O": 845,
      "##3ccc": 846,
      "CCCCCCCCCC": 847,
      "N1CCC2": 848,
      "C1c1ccc": 849,
      "Si": 850,
      "##S1": 851,
      "CSCC": 852,
      "C3CCN": 853,
      "c3ccccc3C": 854,
      "c3cccc4": 855,
      "NCc1cccc": 856,
      "o3": 857,
      "##cnc2c": 858,
      "##OC1": 859,
      "ccc1F": 860,
      "##O3": 861,
      "CCc1cccc": 862,
      "##nc23": 863,
      "Cc3": 864,
      "CC2C": 865,
      "c1cc2ccccc2": 866,
      "1c1ccc": 867,
      "Cn1nc": 868,
      "CCc2ccc": 869,
      "##c3ccccc3c2": 870,
      "c3ncc": 871,
      "CCC4": 872,
      "c2F": 873,
      "OCCO2": 874,
      "##CCCO2": 875,
      "CCCCO": 876,
      "c4c3": 877,
      "ccc3c2": 878,
      "3CO": 879,
      "CN2CC": 880,
      "c2ccccc2n1": 881,
      "CC1CCN": 882,
      "C1CN": 883,
      "ccc2n1": 884,
      "c2ccc3ccccc3": 885,
      "##c2nc3ccccc3": 886,
      "c1ccccc1F": 887,
      "c3n": 888,
      "NC2CCCCC2": 889,
      "##3c2": 890,
      "##CCCO1": 891,
      "cnc3": 892,
      "ccc5": 893,
      "COc1ccccc1N1CCN": 894,
      "OCCO3": 895,
      "c2cncc": 896,
      "Nc3nc": 897,
      "NC1CCN": 898,
      "c1ccc2ccccc2c1": 899,
      "CCc1nc": 900,
      "c2nnn": 901,
      "##c2ccccc2C1": 902,
      "c1cc2cc": 903,
      "nc2ccccc21": 904,
      "##ccccc6": 905,
      "ccc2O": 906,
      "NOC": 907,
      "c34": 908,
      "Cc1nnc": 909,
      "c2Cl": 910,
      "CCCOc1ccc": 911,
      "34": 912,
      "##S2": 913,
      "c2cc3ccccc3": 914,
      "##3CC4CC": 915,
      "##n23": 916,
      "sc": 917,
      "n3C": 918,
      "##c3cc4c": 919,
      "COc3ccc": 920,
      "##c1nc2c": 921,
      "Oc2c": 922,
      "c1ccc2nc": 923,
      "2CCN": 924,
      "CCc3ccccc3": 925,
      "##5ccccc5": 926,
      "c3ccc4": 927,
      "##nc21": 928,
      "CSc1nc": 929,
      "c3ccccc3Cl": 930,
      "ncn2": 931,
      "##c4ccccc43": 932,
      "COc1cc2": 933,
      "COCCO": 934,
      "CCSC": 935,
      "c2noc": 936,
      "Oc2cccc": 937,
      "##oc3": 938,
      "CCN2C": 939,
      "c2ncccc": 940,
      "CCCCCCCCCCCC": 941,
      "##1CCCC1": 942,
      "##cnccc": 943,
      "cccc1Cl": 944,
      "cccc2Cl": 945,
      "##3CCOCC3": 946,
      "c1ccccc1O": 947,
      "C2O": 948,
      "##c1ccccc1C": 949,
      "CSc2nnc": 950,
      "2CCCN2C": 951,
      "COc1cc2nc": 952,
      "nc2ccc": 953,
      "cccc4": 954,
      "nc3cc": 955,
      "cc2s1": 956,
      "O4": 957,
      "##3CCCCC3": 958,
      "CCOP": 959,
      "c5cc": 960,
      "cn4": 961,
      "##3ccccc3c2": 962,
      "Nc2n": 963,
      "nn12": 964,
      "3CN": 965,
      "##c3ccccc3C2": 966,
      "c1sc": 967,
      "CN3CCN": 968,
      "CNc1nc": 969,
      "c2nc3c": 970,
      "##NS": 971,
      "cc2OC": 972,
      "cc34": 973,
      "1CCCC": 974,
      "cc1Br": 975,
      "C6": 976,
      "nc2n1": 977,
      "NCCNC": 978,
      "nc23": 979,
      "c2nccc": 980,
      "Nc1ccccc1C": 981,
      "c2s": 982,
      "c2o": 983,
      "ccc34": 984,
      "oc12": 985,
      "c2nc3cc": 986,
      "##2CCCCC2": 987,
      "c1s": 988,
      "c2sc": 989,
      "Cc1ccc2nc": 990,
      "##4cnc": 991,
      "n1Cc1ccc": 992,
      "c3nc4ccccc4": 993,
      "Cn1cnc": 994,
      "c32": 995,
      "c2ncn": 996,
      "ccn2": 997,
      "c2ccc3nc": 998,
      "##1CCCCC1": 999,
      "##c2ncc": 1000,
      "NCCc1ccccc1": 1001,
      "c2ccc3ccccc3c2": 1002,
      "oc2": 1003,
      "Cc1csc": 1004,
      "##3ccccc23": 1005,
      "NCc1cc": 1006,
      "##cccc1C": 1007,
      "c1cc2": 1008,
      "Nc4cc": 1009,
      "c1ccc2cc": 1010,
      "CC1CN": 1011,
      "OCc3ccc": 1012,
      "##2c1C": 1013,
      "##c2ccccn2": 1014,
      "c2nc3": 1015,
      "Nc1ccc2": 1016,
      "##4ccccc4c3": 1017,
      "Oc3cc": 1018,
      "c3ccccc3C2": 1019,
      "C1OC": 1020,
      "c2ccccc2O": 1021,
      "2CCC": 1022,
      "cc3OC": 1023,
      "CO2": 1024,
      "c2ccccc2c1": 1025,
      "cccc12": 1026,
      "##c3ccccc3C": 1027,
      "##ncccc3": 1028,
      "ccc2OC": 1029,
      "c1cccc2ccccc12": 1030,
      "CP": 1031,
      "##c1nccc": 1032,
      "##c1cnc": 1033,
      "NCCc1ccc": 1034,
      "ncnc21": 1035,
      "7O": 1036,
      "CCCc1cc": 1037,
      "c1nc2c": 1038,
      "N3CCCC": 1039,
      "ccc2Cl": 1040,
      "##nc1C": 1041,
      "c3ccccc3F": 1042,
      "nnc2": 1043,
      "c1o": 1044,
      "ccc2F": 1045,
      "##3CCC": 1046,
      "CCCN1C": 1047,
      "oc": 1048,
      "c2cnn": 1049,
      "##ccccc45": 1050,
      "on2": 1051,
      "NCCCCN": 1052,
      "Cc2ccc3c": 1053,
      "c4nc": 1054,
      "N1c1ccc": 1055,
      "C4C": 1056,
      "CCCOC": 1057,
      "c4cnc": 1058,
      "##CCOCC5": 1059,
      "##cccc1": 1060,
      "c1ccn": 1061,
      "Oc1c": 1062,
      "N1N": 1063,
      "OCC1": 1064,
      "Cn1ccc": 1065,
      "Nc2nccc": 1066,
      "##c3C": 1067,
      "43": 1068,
      "##ccccc13": 1069,
      "COc1ccc2cc": 1070,
      "CCN1CC": 1071,
      "##c1nc2cc": 1072,
      "SC1": 1073,
      "c3cc4c": 1074,
      "C2N": 1075,
      "Cc1cccnc1": 1076,
      "c3nnc": 1077,
      "1c1ccccc1": 1078,
      "c3ccnc": 1079,
      "COc1ccccc1NC": 1080,
      "3C2": 1081,
      "##3CC": 1082,
      "Nc2nnc": 1083,
      "nc5": 1084,
      "##n2c1": 1085,
      "##2CCCC2": 1086,
      "n2ncc": 1087,
      "cc6": 1088,
      "##c1nc2ccc": 1089,
      "1C2": 1090,
      "##CCCO3": 1091,
      "CF": 1092,
      "CCCC4": 1093,
      "C1C2": 1094,
      "n4cc": 1095,
      "##nc2n1": 1096,
      "CC2CC2": 1097,
      "##sc3c": 1098,
      "COc1nc": 1099,
      "C3CC": 1100,
      "Oc1ccc2c": 1101,
      "##NC1": 1102,
      "CCCCCNC": 1103,
      "nc3c": 1104,
      "CO1": 1105,
      "Nc2ccccc2C": 1106,
      "c1ccccc1NC": 1107,
      "CCN1CCC": 1108,
      "nc1N": 1109,
      "##Oc2ccc": 1110,
      "COc2ccccc2": 1111,
      "N4CCC": 1112,
      "NP": 1113,
      "NC2CCN": 1114,
      "12CCC": 1115,
      "sc3": 1116,
      "cc2n1": 1117,
      "Nc3ncc": 1118,
      "Nc3c": 1119,
      "c3cncc": 1120,
      "c4ccco4": 1121,
      "C1c2ccccc2C": 1122,
      "c3C2": 1123,
      "c2cc3": 1124,
      "Cc2n": 1125,
      "c3ccccc3n2": 1126,
      "c2nc3ccc": 1127,
      "Nc4ccccc4": 1128,
      "##occc": 1129,
      "2NC": 1130,
      "NCc2cc": 1131,
      "##n1Cc1ccc": 1132,
      "nc3ccccc23": 1133,
      "c3cnn": 1134,
      "##nc3c2": 1135,
      "c1ccnc": 1136,
      "CCCCCCCCCCCCCCCC": 1137,
      "NCCS": 1138,
      "c1c2ccccc2": 1139,
      "c1cccc2": 1140,
      "c2cccc3ccccc23": 1141,
      "c1ccccc12": 1142,
      "NCCCO": 1143,
      "CCNS": 1144,
      "Cc1nc2c": 1145,
      "3N": 1146,
      "CCCCCN": 1147,
      "ccc1NC": 1148,
      "CCCCCCN": 1149,
      "ncn1": 1150,
      "cc3C2": 1151,
      "##4cc": 1152,
      "cc1OCC": 1153,
      "OCO5": 1154,
      "CCCCCCCCCCCCCC": 1155,
      "CC1CC1": 1156,
      "NC1CCCC1": 1157,
      "CCCCCCCCCCC": 1158,
      "NCc1ccco1": 1159,
      "##n5": 1160,
      "##c2ccc3c": 1161,
      "NC1CC1": 1162,
      "ccc1OCC": 1163,
      "c1nnn": 1164,
      "C12": 1165,
      "c2cc3cc": 1166,
      "##CN1": 1167,
      "c4cccnc4": 1168,
      "Nc4cccc": 1169,
      "##3CCCC3": 1170,
      "CNc2nc": 1171,
      "N4CCCC4": 1172,
      "##C1CCN": 1173,
      "Cc1nc2": 1174,
      "C2CCCC2": 1175,
      "Oc4ccc": 1176,
      "NC1C": 1177,
      "n1nc": 1178,
      "S2": 1179,
      "13": 1180,
      "COCCNC": 1181,
      "N4C": 1182,
      "NCc4ccc": 1183,
      "Nc1nc2c": 1184,
      "OCc1ccc": 1185,
      "n4cnc": 1186,
      "n5": 1187,
      "c1ccccc1C2": 1188,
      "nn23": 1189,
      "nc3ccc": 1190,
      "n3nc": 1191,
      "nn1C": 1192,
      "c4ccccn4": 1193,
      "##4CCOCC4": 1194,
      "C1CCCC1": 1195,
      "c1cnn": 1196,
      "CCCCOC": 1197,
      "Cc2cn": 1198,
      "CCCCn1c": 1199,
      "ccc3n2": 1200,
      "OCc4ccccc4": 1201,
      "NCC3": 1202,
      "n3ccc": 1203,
      "c3F": 1204,
      "##nc4ccc": 1205,
      "c5c4": 1206,
      "c5cccc": 1207,
      "sc1": 1208,
      "##n2ccc": 1209,
      "N2CCC3": 1210,
      "CCCCC3": 1211,
      "OCCCO": 1212,
      "##1C2": 1213,
      "cc2cc": 1214,
      "Cc2cnc": 1215,
      "CSc1": 1216,
      "CSc2": 1217,
      "##CN1C": 1218,
      "CCOc1cccc": 1219,
      "##c1ccccn1": 1220,
      "C1c2ccccc2": 1221,
      "##O4": 1222,
      "NCc2cccc": 1223,
      "C2CN": 1224,
      "NC3CCCCC3": 1225,
      "c2ccccc2OC": 1226,
      "Nc1ncnc2c1ncn2": 1227,
      "3COC": 1228,
      "c3nccc": 1229,
      "##2CN": 1230,
      "C3CCCC3": 1231,
      "CCc3ccc": 1232,
      "c3nn": 1233,
      "ccc3C": 1234,
      "OCCO4": 1235,
      "ncc1C": 1236,
      "c4ccncc4": 1237,
      "CCCc1c": 1238,
      "C2CCC": 1239,
      "##OCCO": 1240,
      "##c5cc": 1241,
      "c1ccccc1N": 1242,
      "NC2CCCC2": 1243,
      "OC4": 1244,
      "##4ccc": 1245,
      "nc2C": 1246,
      "N3CCNCC3": 1247,
      "cs3": 1248,
      "##nc43": 1249,
      "Cn1cn": 1250,
      "CN3CCC": 1251,
      "N1CCc2c": 1252,
      "n1CC": 1253,
      "CCCCOc1ccc": 1254,
      "n2ccnc2": 1255,
      "CSc2nc": 1256,
      "3OP": 1257,
      "NCCc2ccc": 1258,
      "c1S": 1259,
      "n2c1": 1260,
      "##n3c2": 1261,
      "cccc3Cl": 1262,
      "##N2C": 1263,
      "COS": 1264,
      "Oc4ccccc4": 1265,
      "##c1ccccc1Cl": 1266,
      "n2n1": 1267,
      "Nc4": 1268,
      "cccc1F": 1269,
      "n3cnc": 1270,
      "##SC1": 1271,
      "NC2CC2": 1272,
      "Fc1cccc": 1273,
      "Cc1ccccc1NC": 1274,
      "cn2C": 1275,
      "c2cc1C": 1276,
      "c4nc5": 1277,
      "sc1C": 1278,
      "CSC1": 1279,
      "COc1": 1280,
      "n4ccc": 1281,
      "c1C2": 1282,
      "Clc1cccc": 1283,
      "CC2CCCCC2": 1284,
      "CCc1cc2c": 1285,
      "##N1CCOCC1": 1286,
      "##CCCC5": 1287,
      "1ccc": 1288,
      "n4cnc5c": 1289,
      "Nc1nccs1": 1290,
      "3CCCN": 1291,
      "c1nc2cc": 1292,
      "cc4F": 1293,
      "##n1ccc": 1294,
      "##4c3": 1295,
      "##CCCCCC1": 1296,
      "1CC2": 1297,
      "2CCCC": 1298,
      "Cc1cccs1": 1299,
      "##c2cccnc2": 1300,
      "Cn1ccnc1": 1301,
      "NCc2ccco2": 1302,
      "COc1ccc2nc": 1303,
      "Nc1cccnc1": 1304,
      "##c5c": 1305,
      "Cn1ncc": 1306,
      "##c3ccccn3": 1307,
      "ncc2": 1308,
      "c6ccc": 1309,
      "OCc2cc": 1310,
      "NCCc1c": 1311,
      "##c1O": 1312,
      "c1CC": 1313,
      "##4O": 1314,
      "##oc2c1": 1315,
      "c3O": 1316,
      "CCCc1ccc": 1317,
      "Nc1nccc": 1318,
      "c4cnn": 1319,
      "c1ccccc1OC": 1320,
      "cc3n2": 1321,
      "c5c": 1322,
      "OCc2": 1323,
      "Sc2ccc": 1324,
      "##CCCN1C": 1325,
      "Cn2ccc": 1326,
      "cccc3F": 1327,
      "##CCCOc1ccc": 1328,
      "c7": 1329,
      "ccc2c": 1330,
      "##CC1C": 1331,
      "CCO2": 1332,
      "Nc3ccc4c": 1333,
      "c3Cl": 1334,
      "nn4": 1335,
      "CN2CCOCC2": 1336,
      "##n1ccnc1": 1337,
      "##sc2c": 1338,
      "C2C1": 1339,
      "##c2cc3c": 1340,
      "NC3CC3": 1341,
      "ncc1": 1342,
      "Cn3cc": 1343,
      "1COC": 1344,
      "N1Cc1ccc": 1345,
      "2c3cc4c": 1346,
      "NCCc2ccccc2": 1347,
      "2H": 1348,
      "cc3O": 1349,
      "N1CC2": 1350,
      "c2ccn": 1351,
      "SC2": 1352,
      "##nc3ccccc23": 1353,
      "c4cccs4": 1354,
      "3COP": 1355,
      "##ncn": 1356,
      "##n3cc": 1357,
      "c3cc4ccccc4": 1358,
      "N4CCCCC4": 1359,
      "##32": 1360,
      "c2cc1": 1361,
      "10": 1362,
      "CCN2": 1363,
      "c4ccccc43": 1364,
      "##c3nnc": 1365,
      "##n2nc": 1366,
      "##CC1CC1": 1367,
      "##6C": 1368,
      "cccc21": 1369,
      "##CCN2C": 1370,
      "Oc2": 1371,
      "Oc2nc": 1372,
      "c2N": 1373,
      "c2ccsc2": 1374,
      "Cc1nc2ccccc2": 1375,
      "COc1ncc": 1376,
      "oc1": 1377,
      "c3ccccc3c2": 1378,
      "c1nc2": 1379,
      "CCCCCCCCCCCCCCC": 1380,
      "##2c3c": 1381,
      "NCCN1": 1382,
      "Cc2cccnc2": 1383,
      "c2ncnc3": 1384,
      "c1cnccn1": 1385,
      "NCCOCCO": 1386,
      "1CCCN1": 1387,
      "c3c2C": 1388,
      "Cc2nc": 1389,
      "CCc1n": 1390,
      "COc2cccc": 1391,
      "##CCCCCC2": 1392,
      "c2ccccc2S": 1393,
      "C1CC2": 1394,
      "c2c3c": 1395,
      "c1nc2ccc": 1396,
      "OC2CCN": 1397,
      "c2OC": 1398,
      "CC3CC3": 1399,
      "##c3cn": 1400,
      "12O": 1401,
      "Nc1nc2ccc": 1402,
      "n2cn": 1403,
      "##no": 1404,
      "##CCCCCC": 1405,
      "c1nccc": 1406,
      "Cc1oc": 1407,
      "N1CCCN": 1408,
      "cccc2C": 1409,
      "Cn1cncn1": 1410,
      "##nc32": 1411,
      "N2CCNCC2": 1412,
      "Cc1ccnc": 1413,
      "CCc2c": 1414,
      "##c1cc1": 1415,
      "##nn1": 1416,
      "CCCn1": 1417,
      "cnc12": 1418,
      "cnn2": 1419,
      "Se": 1420,
      "##c3cccc4": 1421,
      "##N1CCC": 1422,
      "##4CCC": 1423,
      "CO3": 1424,
      "c2no": 1425,
      "NCCCCCC": 1426,
      "##CC6": 1427,
      "##N1CC": 1428,
      "c2ccc3cc": 1429,
      "c1Br": 1430,
      "2COC": 1431,
      "c4C": 1432,
      "c3ccccc3OC": 1433,
      "##n2ccnc2": 1434,
      "CNc1ccc": 1435,
      "cn12": 1436,
      "oc3": 1437,
      "n1cnc": 1438,
      "n3n2": 1439,
      "CNc2ccc": 1440,
      "CC1CCC": 1441,
      "c3ccc4ccccc4c3": 1442,
      "COc1cccc2c1": 1443,
      "##c1ccncc1": 1444,
      "CNC1": 1445,
      "3CCC": 1446,
      "CN3C": 1447,
      "Nc1nc2ccccc2": 1448,
      "##sc4": 1449,
      "##oc4": 1450,
      "COc3ccccc3": 1451,
      "OCOC": 1452,
      "nc3ccccc32": 1453,
      "##Oc2ccccc2": 1454,
      "c3nnn": 1455,
      "1CNC": 1456,
      "c1c2c": 1457,
      "##c1cc2c": 1458,
      "c2ccc3ncc": 1459,
      "N5CCN": 1460,
      "Cn2nc": 1461,
      "Cc1ccco1": 1462,
      "Nc2nc3ccccc3": 1463,
      "##5cc": 1464,
      "CN2CCCC2": 1465,
      "CCN2CCN": 1466,
      "c1OCC": 1467,
      "no3": 1468,
      "##c4ccccc4C3": 1469,
      "Cc2ccco2": 1470,
      "cccc2F": 1471,
      "##nc3ccc": 1472,
      "CCOCC": 1473,
      "ccc2O1": 1474,
      "NCC1CCCO1": 1475,
      "cc2NC": 1476,
      "##OC3": 1477,
      "##CCN1CCN": 1478,
      "CCNc1nc": 1479,
      "OCc2cccc": 1480,
      "CCc1nnc": 1481,
      "##4CCCC4": 1482,
      "c1ccccc1S": 1483,
      "##4CC5": 1484,
      "CSC2": 1485,
      "Cc1cc2": 1486,
      "##C1CC": 1487,
      "##CCOc1ccc": 1488,
      "##nc2C": 1489,
      "cccc2c1": 1490,
      "CCCCc1ccc": 1491,
      "CCc2cc": 1492,
      "nc2c1ncn2": 1493,
      "n12": 1494,
      "co2": 1495,
      "OCC3": 1496,
      "CN3CCOCC3": 1497,
      "CCn1nc": 1498,
      "##1CC2": 1499,
      "cc1CN": 1500,
      "NN2C": 1501,
      "N2CCCCCC2": 1502,
      "##ns": 1503,
      "##c2cnc": 1504,
      "NCCN2": 1505,
      "oc2c": 1506,
      "NC3CCN": 1507,
      "c2ncccn2": 1508,
      "2c2ccc": 1509,
      "sc4": 1510,
      "COCCC": 1511,
      "NC4CC4": 1512,
      "c1CN": 1513,
      "n2cccc": 1514,
      "2c": 1515,
      "##c1cccnc1": 1516,
      "n2nn": 1517,
      "COc2cc": 1518,
      "CCCCCCCCCCCCCCCCCC": 1519,
      "Nc1ccc2nc": 1520,
      "c3ccsc3": 1521,
      "CN2CCCCC2": 1522,
      "Oc2ccc3c": 1523,
      "##4ccccc4n3": 1524,
      "OC1C": 1525,
      "##C2CC2": 1526,
      "C4CCCCC4": 1527,
      "c2sccc": 1528,
      "ccc43": 1529,
      "ccc4c3": 1530,
      "##c1ccccc12": 1531,
      "##nc34": 1532,
      "N2CCCN": 1533,
      "CN5": 1534,
      "C1c1ccccc1": 1535,
      "##c1nn": 1536,
      "c4ccc5c": 1537,
      "Cc1onc": 1538,
      "Cc4cccc": 1539,
      "c1ccsc1": 1540,
      "##6c": 1541,
      "##CCN2": 1542,
      "ccc3c": 1543,
      "NC1CCC": 1544,
      "c3ccoc3": 1545,
      "c2nc3ccccc3s2": 1546,
      "nc2N": 1547,
      "CCCCN1C": 1548,
      "c3nc4cc": 1549,
      "##nn2": 1550,
      "CCC1C": 1551,
      "c4ccccc4C": 1552,
      "C12CC3CC": 1553,
      "##c5cccc": 1554,
      "2C3": 1555,
      "ccc2cc": 1556,
      "##n1Cc1ccccc1": 1557,
      "C23CC4CC": 1558,
      "##sc2nc": 1559,
      "##c1nc2": 1560,
      "Nc2ccc3": 1561,
      "##2ccccc2n1": 1562,
      "O5": 1563,
      "C3CCC3": 1564,
      "NCc1ccc2c": 1565,
      "ncnc2cc": 1566,
      "##n1cnc2c": 1567,
      "Nc1ccccc1Cl": 1568,
      "nc2ccccc2c1": 1569,
      "Cc2cccs2": 1570,
      "oc2ccc": 1571,
      "N5CCOCC5": 1572,
      "C2OC": 1573,
      "cc43": 1574,
      "CCc3c": 1575,
      "2O1": 1576,
      "Brc1ccc": 1577,
      "##nnnc1": 1578,
      "cc3s2": 1579,
      "6C": 1580,
      "COc1cc2ncnc": 1581,
      "##nc2ccccc12": 1582,
      "cc4c3": 1583,
      "oc3c2": 1584,
      "OCCOC": 1585,
      "##4CCN": 1586,
      "n2CC": 1587,
      "Nc1nc2cc": 1588,
      "SCc2ccc": 1589,
      "cccc23": 1590,
      "N2CC3": 1591,
      "Cc1ccc2ccccc2c1": 1592,
      "##c1c2c": 1593,
      "##cncn2": 1594,
      "Cc5ccccc5": 1595,
      "OCCCCC": 1596,
      "Oc3c": 1597,
      "c5ccccc45": 1598,
      "CCCc1ccccc1": 1599,
      "Sc2ccccc2": 1600,
      "C1CCS": 1601,
      "##n1CC": 1602,
      "nc1O": 1603,
      "##3cccc": 1604,
      "CCN2CCC": 1605,
      "34C": 1606,
      "c1noc": 1607,
      "cnc": 1608,
      "##c3n2": 1609,
      "cc13": 1610,
      "1CS": 1611,
      "NCc1cccnc1": 1612,
      "ncnc43": 1613,
      "CCCN1CCN": 1614,
      "c1cccc2c": 1615,
      "23CC": 1616,
      "sc2n1": 1617,
      "NC1CC": 1618,
      "Nc1cc2c": 1619,
      "NCCCCC": 1620,
      "##c1cc1n": 1621,
      "CSc1ccccc1": 1622,
      "nn2C": 1623,
      "c3ccccc3O": 1624,
      "##N1CCCC1": 1625,
      "##c3ccncc3": 1626,
      "c1cnc2c": 1627,
      "COc1cc2cc": 1628,
      "n1Cc1ccccc1": 1629,
      "##4nc": 1630,
      "ccn3": 1631,
      "##nc2N": 1632,
      "NCCCNC": 1633,
      "##1OCCCN": 1634,
      "##CCOCCOCCOCCO": 1635,
      "Nc2nccs2": 1636,
      "CBr": 1637,
      "C1Nc2ccc": 1638,
      "c2ccccc2N": 1639,
      "CCc1nn": 1640,
      "ccc3OC": 1641,
      "noc2C": 1642,
      "1cccc": 1643,
      "CCO1": 1644,
      "2ccc": 1645,
      "n1ccc": 1646,
      "##nc1O": 1647,
      "C2C3": 1648,
      "COc1ccccc1CN": 1649,
      "n3ccnc3": 1650,
      "Cc1cnn": 1651,
      "N2C1": 1652,
      "N2N": 1653,
      "##c1cncc": 1654,
      "CCN3C": 1655,
      "cc1NS": 1656,
      "##C4": 1657,
      "N4CC": 1658,
      "OCc2c1cc1n": 1659,
      "Cc4": 1660,
      "nccc": 1661,
      "##oc3cc": 1662,
      "cnc1C": 1663,
      "c1sccc": 1664,
      "Cc2ccc3ccccc3c2": 1665,
      "CNc1cc": 1666,
      "Nc1ccccn1": 1667,
      "ccc2N": 1668,
      "N1CCc2cc": 1669,
      "Cc1nc2cc": 1670,
      "c2cnccn2": 1671,
      "nnc3": 1672,
      "##CC2CC2": 1673,
      "ncnc2": 1674,
      "NCC2CCCO2": 1675,
      "CN1CCC2": 1676,
      "CCCN1": 1677,
      "NN1C": 1678,
      "##CCN1CCC": 1679,
      "Cc4cc": 1680,
      "ccc2o1": 1681,
      "##ccccc21": 1682,
      "##c2c3c": 1683,
      "NCCc3ccc": 1684,
      "2cc": 1685,
      "nc2c1c": 1686,
      "nc2s1": 1687,
      "CCCCS": 1688,
      "sc3c2": 1689,
      "##occ": 1690,
      "nc3n2": 1691,
      "Nc5ccc": 1692,
      "c3ncccc": 1693,
      "COc1cccc2c1C": 1694,
      "CN1CCOCC1": 1695,
      "Nc1ccn": 1696,
      "##c3ncnc": 1697,
      "1Cc2ccccc2": 1698,
      "##c1ncnc2": 1699,
      "##Nc1ccc": 1700,
      "COc1cccc2": 1701,
      "CN2CCCC": 1702,
      "3CCC4": 1703,
      "NO1": 1704,
      "##4CC5CC": 1705,
      "C2NC": 1706,
      "Cc1ccsc1": 1707,
      "COc1ccccc1CNC": 1708,
      "c3ncccn3": 1709,
      "##2C3": 1710,
      "31": 1711,
      "##4CCCCC4": 1712,
      "NCc1c": 1713,
      "ccc3O": 1714,
      "CNC2": 1715,
      "N12": 1716,
      "Cc1sc": 1717,
      "NCc3cccc": 1718,
      "##sc1C": 1719,
      "1cc": 1720,
      "Nc1ccccc1F": 1721,
      "NC12CC3CC": 1722,
      "##scn": 1723,
      "N1c2ccccc2": 1724,
      "CN1CCCC1": 1725,
      "n3cnc4c": 1726,
      "NCCN1CCOCC1": 1727,
      "##CC2C": 1728,
      "CN3CCCCC3": 1729,
      "Oc3cccc": 1730,
      "c1nc2ccccc2s1": 1731,
      "NCc3ccco3": 1732,
      "Cn2ccnc2": 1733,
      "##CCCCC5": 1734,
      "ccc1Oc1ccc": 1735,
      "c4cn": 1736,
      "cn3C": 1737,
      "NC3CCCC3": 1738,
      "nc3ccccc3c2": 1739,
      "Cn2cnc3c": 1740,
      "c3cccc4ccccc34": 1741,
      "N2CCc3c": 1742,
      "co1": 1743,
      "##noc": 1744,
      "##oc2cc": 1745,
      "CCCc2ccccc2": 1746,
      "c4n3": 1747,
      "c1ccccc1Br": 1748,
      "ccc3F": 1749,
      "c1cccc2c1": 1750,
      "CSc1n": 1751,
      "##ncccc2": 1752,
      "Cc1cc2cc": 1753,
      "N1Cc1ccccc1": 1754,
      "c6ccccc6": 1755,
      "##cccnc23": 1756,
      "##C1CC1": 1757,
      "Cc3ccc4c": 1758,
      "##4CC4": 1759,
      "c4ncc": 1760,
      "ccc2C1": 1761,
      "CCCCCO": 1762,
      "OCCNC": 1763,
      "C2CCC2": 1764,
      "c2nccs2": 1765,
      "##c3nc4ccccc4": 1766,
      "##c2ccncc2": 1767,
      "CN3CCCC3": 1768,
      "n3c2": 1769,
      "COc1n": 1770,
      "Cc3cccnc3": 1771,
      "4OC": 1772,
      "Cc1cccc2ccccc12": 1773,
      "Nc2ccccn2": 1774,
      "NCCc3ccccc3": 1775,
      "Nc2ncnc3": 1776,
      "C21": 1777,
      "##c1ccnc": 1778,
      "c3ccccc31": 1779,
      "COc1ccccc1N": 1780,
      "CCCc1nc": 1781,
      "3CCN": 1782,
      "##c1c2ccccc2": 1783,
      "C3O": 1784,
      "##5ccccc5c4": 1785,
      "##c1ccnc2cc": 1786,
      "COCCn1c": 1787,
      "c3csc": 1788,
      "cc2o1": 1789,
      "CN1CCCCC1": 1790,
      "nc2n": 1791,
      "cn23": 1792,
      "ccc5c4": 1793,
      "Cn1cnc2c": 1794,
      "c3noc": 1795,
      "C4CCN": 1796,
      "##n4cc": 1797,
      "cn1C": 1798,
      "##2cccnc12": 1799,
      "##c6ccccc6": 1800,
      "CC1C3": 1801,
      "c2cnc3c": 1802,
      "Nc3ccccc3C": 1803,
      "2CNC": 1804,
      "Nc2c3ccccc3": 1805,
      "##n1nc": 1806,
      "ccc3o2": 1807,
      "13C": 1808,
      "c3OC": 1809,
      "cc2N": 1810,
      "Cc2ccccc2F": 1811,
      "CC1CCCN": 1812,
      "CSc1nc2ccccc2": 1813,
      "c2cccc3c": 1814,
      "Nc2ccccc21": 1815,
      "C1CCC2": 1816,
      "oc2ccccc12": 1817,
      "Cc1nc2ccc": 1818,
      "35": 1819,
      "32C": 1820,
      "CSc2ccc": 1821,
      "Cc1ccncc1": 1822,
      "SCCC": 1823,
      "ccc3Cl": 1824,
      "CN1CCCC": 1825,
      "##nn3": 1826,
      "n3ncc": 1827,
      "n1ccnc1": 1828,
      "C1c1cccc": 1829,
      "CN2CCC3": 1830,
      "##nc6": 1831,
      "OCCCCN": 1832,
      "##c1ccc1": 1833,
      "c2ncnc": 1834,
      "cc2c1O": 1835,
      "24O": 1836,
      "C3CCCN": 1837,
      "##c7": 1838,
      "c4ccccc4F": 1839,
      "C1CCC1": 1840,
      "Clc1ccc2c": 1841,
      "NCCN3": 1842,
      "NCc1ccccn1": 1843,
      "n1ncc": 1844,
      "Cc1ccccn1": 1845,
      "CSCCC": 1846,
      "c1cn2c": 1847,
      "cc1C2": 1848,
      "CCOCC1": 1849,
      "##2oc": 1850,
      "c3ncnc4": 1851,
      "ncc3": 1852,
      "c2oc": 1853,
      "nc54": 1854,
      "Oc1nc": 1855,
      "##CCCCC1C": 1856,
      "Cc4c": 1857,
      "OCc3c": 1858,
      "CCOc2ccc": 1859,
      "##c3ncc": 1860,
      "cc2c1C": 1861,
      "CCCN1CCC": 1862,
      "c13": 1863,
      "##3ccccc3n2": 1864,
      "SCc2ccccc2": 1865,
      "24OO3": 1866,
      "##oc2c": 1867,
      "c2cn1": 1868,
      "1c": 1869,
      "cc2N1": 1870,
      "##c2ccccc2c2cc": 1871,
      "N3CCCCCC3": 1872,
      "##4ccccc34": 1873,
      "##c3ccccc3c": 1874,
      "cccc3C": 1875,
      "CCCCCCNC": 1876,
      "cc4CC": 1877,
      "cc4Cl": 1878,
      "C5C": 1879,
      "C5CC5": 1880,
      "##c3cccnc3": 1881,
      "2c2ccccc2": 1882,
      "##6CC": 1883,
      "NCc4ccccc4": 1884,
      "Nc3nccc": 1885,
      "nc2c1C": 1886,
      "C4CC": 1887,
      "CCNCC": 1888,
      "N1c1ccccc1": 1889,
      "c1cc2ccc": 1890,
      "c2cs": 1891,
      "Nc1cn": 1892,
      "nc3C": 1893,
      "11": 1894,
      "Cc1ccccc1N": 1895,
      "Nc1cnc": 1896,
      "C7": 1897,
      "ccc1Nc1ncc": 1898,
      "CCn2c": 1899,
      "Cc1ccc2cc": 1900,
      "CC3CCCCC3": 1901,
      "##SC2": 1902,
      "CCO3": 1903,
      "CNCCN": 1904,
      "CCCN2C": 1905,
      "c1coc": 1906,
      "##S3": 1907,
      "ccnc2c1": 1908,
      "c4O": 1909,
      "c3ncccc3": 1910,
      "##C1CCCCC1": 1911,
      "Nc2cn": 1912,
      "cnn": 1913,
      "c4cncc": 1914,
      "Cn1c2c": 1915,
      "##c2ncnc": 1916,
      "##ccccc32": 1917,
      "cc2nc": 1918,
      "CS2": 1919,
      "NC5": 1920,
      "oc3cc": 1921,
      "CC1c1ccc": 1922,
      "##NC2": 1923,
      "Nc1ccncc1": 1924,
      "NCc2ccc3c": 1925,
      "Sc3ccc": 1926,
      "CCOc1ccc2c": 1927,
      "##CCN1CC": 1928,
      "##CCCCCC3": 1929,
      "CCCc3ccccc3": 1930,
      "oc4": 1931,
      "c2cc3nc": 1932,
      "OCc1cc": 1933,
      "Cc3ccco3": 1934,
      "OCc2c": 1935,
      "Cc2ccncc2": 1936,
      "Cc2ccccn2": 1937,
      "##onc1": 1938,
      "NCc2cccnc2": 1939,
      "c2s1": 1940,
      "C1c2c": 1941,
      "1Cc2c": 1942,
      "cnc23": 1943,
      "##5ccc": 1944,
      "OC2C": 1945,
      "##n2Cc2ccc": 1946,
      "N1CCCCCC1": 1947,
      "##OP": 1948,
      "nc3ccccc13": 1949,
      "CCOC1": 1950,
      "c1ncnc2": 1951,
      "ccc45": 1952,
      "2c3cc": 1953,
      "##sc4c": 1954,
      "c3ncnc": 1955,
      "##c34": 1956,
      "c3ccccc3S": 1957,
      "cc4c": 1958,
      "Cc2ccccc2Cl": 1959,
      "CC2CCN": 1960,
      "SCCN": 1961,
      "nnc12": 1962,
      "c3ccccc13": 1963,
      "c2ccccc2Br": 1964,
      "c2ccccc2C3": 1965,
      "Cc1cc2nc": 1966,
      "6CC": 1967,
      "##5c4": 1968,
      "ncc12": 1969,
      "##n2CC": 1970,
      "ON": 1971,
      "Cc1cncc": 1972,
      "cc4C": 1973,
      "##2S": 1974,
      "c2cnc3": 1975,
      "c1ccoc1": 1976,
      "COC2": 1977,
      "CC6": 1978,
      "c2c1O": 1979,
      "Cn3c": 1980,
      "s4": 1981,
      "##c1ccccc1F": 1982,
      "n3cccc": 1983,
      "45C": 1984,
      "Nn1c": 1985,
      "CON": 1986,
      "##CCCCC2C": 1987,
      "ccc2ccccc12": 1988,
      "NCCN1C": 1989,
      "CCCCc1nc": 1990,
      "Nc2ccccc2Cl": 1991,
      "OC5": 1992,
      "C3CCOCC3": 1993,
      "Nc2cccnc2": 1994,
      "cnc32": 1995,
      "C2S": 1996,
      "Cc3ccccc3F": 1997,
      "c4nc5ccccc5": 1998,
      "ccc3N": 1999,
      "cnn1": 2000,
      "n2cccc2": 2001,
      "##2ncnc": 2002,
      "ncn3": 2003,
      "NCc1cccs1": 2004,
      "Oc4cc": 2005,
      "##cnnn2": 2006,
      "cc3o2": 2007,
      "c4ccc5": 2008,
      "CCOc1ccccc1NC": 2009,
      "##sc2c1": 2010,
      "2CN1C": 2011,
      "Cc2nnc": 2012,
      "NCCCCCCCC": 2013,
      "COCc1ccccc1": 2014,
      "CCCCCCO": 2015,
      "##c3ccc4c": 2016,
      "OCc3cccc": 2017,
      "c3s2": 2018,
      "NCCCCCN": 2019,
      "nnc1SCC": 2020,
      "##Sc1ccc": 2021,
      "Nc1sc2c": 2022,
      "c1cnc2ccc": 2023,
      "o4": 2024,
      "##c4ccccc4C": 2025,
      "c4ccccc4Cl": 2026,
      "##4CC": 2027,
      "OCc4ccc": 2028,
      "CCC1CC": 2029,
      "CNc2cc": 2030,
      "COCc2ccccc2": 2031,
      "45": 2032,
      "##NCC": 2033,
      "c1nccs1": 2034,
      "Cn2cn": 2035,
      "NCc4cccc": 2036,
      "Nc1ccccc1NC": 2037,
      "1Cc1ccccc1": 2038,
      "3CCCC": 2039,
      "NCc2c": 2040,
      "C12C": 2041,
      "se": 2042,
      "CCNCC2": 2043,
      "CC4CC4": 2044,
      "4CN": 2045,
      "3c4ccc": 2046,
      "Oc1ccc2": 2047,
      "OCC2CC2": 2048,
      "##sccc3": 2049,
      "##Sc2ccc": 2050,
      "cccc32": 2051,
      "Cc2ccccc2C": 2052,
      "cnc2c1": 2053,
      "C2CCCN2C": 2054,
      "N2c2ccc": 2055,
      "N2CCc3ccccc3C2": 2056,
      "N4CCNCC4": 2057,
      "C1CSC": 2058,
      "1ccccc1": 2059,
      "COCc1cc": 2060,
      "##n2Cc2ccccc2": 2061,
      "c1cc2ccccc2o1": 2062,
      "CCCCCCCCN": 2063,
      "##2CCC1CC2": 2064,
      "c3cnccn3": 2065,
      "Clc1ccccc1": 2066,
      "##c3ccccc3n": 2067,
      "3CNC": 2068,
      "NN1": 2069,
      "##sc12": 2070,
      "c1oc": 2071,
      "##c3c1O": 2072,
      "COC3": 2073,
      "N6": 2074,
      "##c1cccc2ccccc12": 2075,
      "CCn1ccc": 2076,
      "sc12": 2077,
      "##CCO2": 2078,
      "##c4nc": 2079,
      "Nc1nc2": 2080,
      "c2cnn3c": 2081,
      "Sc1nnc": 2082,
      "##5ccccc45": 2083,
      "CCOCCOCCO": 2084,
      "Nc1cccc2ccccc12": 2085,
      "##ccccc7": 2086,
      "Nc2nc3c": 2087,
      "1c2ccccc2": 2088,
      "cc3CC": 2089,
      "##C1O": 2090,
      "COc2ccc3c": 2091,
      "c2O1": 2092,
      "##N1CCCCC1": 2093,
      "CN3CC": 2094,
      "CSc2nc3ccccc3": 2095,
      "8O": 2096,
      "N1CCO": 2097,
      "Cc1ccc2oc": 2098,
      "CSc1cccc": 2099,
      "ncc2c1": 2100,
      "Cc5ccc": 2101,
      "CNCCCN": 2102,
      "C2c2ccc": 2103,
      "c2cc3ccc": 2104,
      "Nc1cc2": 2105,
      "Sc1ccc": 2106,
      "CNCCC": 2107,
      "C1c2cc": 2108,
      "CCOc1c": 2109,
      "cccc5": 2110,
      "##N2CCOCC2": 2111,
      "n4C": 2112,
      "##ncccc4": 2113,
      "1Cc1ccc": 2114,
      "cc1Nc1nc": 2115,
      "CNCC2": 2116,
      "CCCN1CC": 2117,
      "##cc2": 2118,
      "CC3C": 2119,
      "Cc1cccc2": 2120,
      "Nc3ccccc32": 2121,
      "##c2nn": 2122,
      "n2Cc2ccc": 2123,
      "##c2sc": 2124,
      "##c3c4c": 2125,
      "CC1CCCC": 2126,
      "c2ccccc23": 2127,
      "NCCN2CCOCC2": 2128,
      "cnc21": 2129,
      "##1CC1": 2130,
      "##c2cc1OC": 2131,
      "COCCCNC": 2132,
      "Clc1cc": 2133,
      "CCN2CCOCC2": 2134,
      "C3CCC": 2135,
      "##c4cc5c": 2136,
      "##nc54": 2137,
      "18": 2138,
      "2Cc3c": 2139,
      "CCOCCO": 2140,
      "##C1CCCC1": 2141,
      "oc1C": 2142,
      "Cn3cnc": 2143,
      "OO": 2144,
      "NC2C": 2145,
      "##ccccc24": 2146,
      "c2ccccc2NC": 2147,
      "N3CC4": 2148,
      "cccc2C1": 2149,
      "NN2": 2150,
      "N3CCC4": 2151,
      "Cc2cccc3ccccc23": 2152,
      "##c2nccc": 2153,
      "NC1c1ccc": 2154,
      "c4ccccc4C3": 2155,
      "C1CO": 2156,
      "NCCCCNC": 2157,
      "N1CCc2ccccc2C1": 2158,
      "Fc1cc": 2159,
      "##nc4c3": 2160,
      "cc3c1": 2161,
      "##CC3CCC": 2162,
      "##ncc5": 2163,
      "c4ccccc4c3": 2164,
      "nn3C": 2165,
      "##1N": 2166,
      "##oc3c": 2167,
      "nc2nc": 2168,
      "##CCNC3": 2169,
      "C2CCNCC2": 2170,
      "c3ccn": 2171,
      "SCc3ccccc3": 2172,
      "OCCCCO": 2173,
      "C4CCCC4": 2174,
      "C1C2C": 2175,
      "12CO": 2176,
      "cccc4F": 2177,
      "1N2C": 2178,
      "Cn1nnc": 2179,
      "COCCOC": 2180,
      "COCCCN": 2181,
      "C1c2cccc": 2182,
      "CN1CCCN": 2183,
      "NCC3CCCO3": 2184,
      "Cc1c2c": 2185,
      "##n1cn": 2186,
      "CCOc1ccccc1C": 2187,
      "C23": 2188,
      "##c2ccccc2N": 2189,
      "c2ccoc2": 2190,
      "NCCc2c": 2191,
      "##CC3C": 2192,
      "##nc2ccc": 2193,
      "C1C3": 2194,
      "##OO4": 2195,
      "CCC2C": 2196,
      "c2c1CC": 2197,
      "3NC": 2198,
      "c1ccc2ccccc2n1": 2199,
      "Cn2nn": 2200,
      "Fc1ccccc1": 2201,
      "Oc3": 2202,
      "2CS": 2203,
      "##CCN1CCOCC1": 2204,
      "OCc3cc": 2205,
      "C1CCOCC1": 2206,
      "n2cccn2": 2207,
      "SCc3ccc": 2208,
      "c1c2cc": 2209,
      "CC12CCC": 2210,
      "CS1": 2211,
      "c2nc3ccccc3c": 2212,
      "CCc4ccccc4": 2213,
      "ccc2N1": 2214,
      "c2c1CN": 2215,
      "Nc3nccs3": 2216,
