[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
#
%
(
)
+
-
.
/
0
1
2
3
4
5
6
7
8
9
=
@
A
B
C
F
H
I
K
L
M
N
O
P
R
S
T
X
Z
[
\
]
a
b
c
e
g
i
l
n
o
p
r
s
t
##O
##C
##1
##c
##4
##5
##n
##N
##2
##l
##o
##3
##S
##0
##9
##s
##6
##P
##8
##F
##r
##7
##B
##I
##H
##e
##i
##R
##a
##K
##X
##b
##g
##p
##T
##cc
##CC
##ccc
##c1
CC
##c2
c1
c2
##ccccc
##c3
NC
cc1
CO
c3
##CCC
##c1ccc
OC
##nc
Cl
##cccc
##CCN
##ccccc2
##ccccc1
CN
cc2
##CCCC
C1
Cc1
c1ccc
nH
c2ccc
##n1
##OC
##ccccc3
C2
CCC
CC1
cc
ccc
##c2ccc
c4
c2ccccc2
cc3
##n2
##c2ccccc2
N1
CCN
##c1cc
COc1ccc
N2
##cn
Cc1ccc
c3ccc
##1C
##c1ccccc1
c1ccccc1
##CCO
CC2
n2
##CCCN
c2cc
n1
##c4
##ncc
1C
##c3ccccc3
c3ccccc3
COC
##2c
##nc2
c1cc
C3
##CCCCC
##c3ccc
Br
##Cl
##c1cccc
##NC
CS
##c2cc
##CC2
##ccccc4
CCCCC
Cc1cc
nc
COc1cc
CCCC
##2C
##n3
c2c
NCC
##c2c
CNC
N3
2C
CCO
Nc1ccc
ccc2
##nn
OCC
c1cccc
CCCN
##c1nc
c1c
CCOC
ccc1
Cc1ccccc1
1O
CC3
c2cccc
##nc3
##CC3
nc2
##CC1
##3c
##nc1
Cn1
##nnc
##c1c
##C1
Cc1c
c3cc
##1CCN
cc4
Nc2
NS
##c3c
cccc
##C2
Nc2ccc
##c3cc
2O
nc1
Cc2ccc
c2c1
c4ccc
1CC
Cc2ccccc2
##s1
n3
##ccccc12
##sc
c5
##CN
ccc3
Cc1cccc
c2nc
C4
c3c
NC1
c4ccccc4
c1C
c3cccc
##oc
OCO
COc1cccc
##c2cccc
##4c
3C
##o1
N2CCN
N1CCC
12
CCCCN
cc1OC
Nc1
N1CCN
CCNC
##CCCCC1
cn1
CN2
C1C
##c4ccccc4
##s2
CN1
##CC4
##3C
nc3
##CCCCC2
##nc4
##c4ccc
NC2
N2C
Nc3ccc
c2n
##ccccc23
SC
COc1ccccc1
##o2
s1
NCCN
cc1C
##c3cccc
3O
N4
N1C
##n1c
Nc1cccc
##CCOCC2
##CCCO
2CC
CCCCCCCCC
NN
c1OC
c2cn
##c2nc
c1ccc2c
c1cn
Nc1cc
##CCCC2
NO
o1
Cc3ccccc3
Nc1nc
Cn2
CCCNC
##c1n
CN1C
##2cc
Cn1c
##CCCC1
c12
##c2c1
Nc1ccccc1
O1
cn2
##2nc
NCCC
N1CC
c2ccccc12
CCOc1ccc
##CCOCC3
1CN
##c5
c1O
c1nc
3CC
O2
##CCCCC3
nn2
Oc1ccc
nn1
N2CCC
##SC
##CCOCC1
##nccc
Cc3ccc
cc12
##ccccc5
cc1Cl
CC4
Cc1nc
ccc1O
##CCNC
##Br
C2C
##n4
ncn
SCC
Nc2cc
Nc2ccccc2
Oc2ccc
CN1CCN
N3CCN
NCc1ccc
##CCCC3
##c1C
cc21
c2ccc3
##2ccccc2
12C
1OC
OCCO
c2ccccc21
##nc2c
CCC1
NC3
##s3
##ncc2
c2ccc3c
o2
C1CC
##N1
c3c2
Cc2c
ncc
NCCCN
##CCC2
N2CC
ccc21
Na
c4cc
##C3
CCS
c1n
CCc1ccc
cccc2
CCN1
Nc2cccc
N2CCOCC2
4C
s2
c3ccccc23
cc1O
##o3
Cc1n
c2C
COc1ccc2c
ccc1C
CCCO
Cn1cc
Nc2nc
##c2ccccc21
NNC
NCCCC
##nnn
cc1F
##cnn
CN3
OCCN
##c3nc
##n1cc
cc2c1
ccc4
COc1cc2c
C1CCN
##c4cc
n4
##12
##ncccc
N3CCOCC3
##ncc3
##n2c
CCCCCC
cn
##cncc
n1C
cc2Cl
OCO3
c2n1
c4cccc
OC1
NCc2ccc
##nc2cc
cn3
Cc2cc
##ccccc34
##2CCN
ccc12
nc2c1
C5
##cnc
C1N
##3ccccc3
##c1nnc
##ncc1
CCN1C
c3nc
cc2C
Nc3ccccc3
##n2C
n2C
##n1C
c2cccnc2
n2cc
1CCCN
OCc1ccccc1
23
CCn1c
Cc2
21
N3CCC
##c4c
##nc3cc
cc5
OCO2
##2c1
2CN
CCCCCCCCCCCCC
n2c
CN2C
nn
Cc2cccc
##1OC
COCC
##c1ncc
c23
no1
##5c
##CCOCC4
cs1
CCC2
cc2F
##CCN1
##nc12
nn3
##c3ccccc32
##nc3c
c1ccc2
cc23
c1cccnc1
C2CC
C2CC2
OCO4
##CCOCCO
Nc3cc
OP
NCc1ccccc1
##2CCC
n2nc
Cc1ccc2c
##N1CCN
##OCC
Oc3ccc
cccc3
OCc2ccccc2
c2cccs2
CCCCCCCC
CN2CCN
CCc1cc
##c2C
c4c
4CC
##O1
COP
##CCCNC
N3C
C2CCN
OCCCC
##c12
1NC
OC2
Nc3
CCc1ccccc1
C3CC3
COc2ccc
Nc1c
##4C
nc12
COc1ccc2
Cc1cn
c2nnc
c1ccco1
c21
c5ccc
c1cccs1
ccc2c1
##c32
COc1c
##CC5
c2ccncc2
##c4cccc
##2ccccc2c1
##4ccccc4
Clc1ccc
##CCC3
c1Cl
##2ccccc12
CCC3
Nc3cccc
c2nn
O3
##CCOC
Nc4ccc
c2ccco2
Cc1nn
##Oc1ccc
CCCCNC
##3cc
1N
C1NC
c1cnc
2OC
N1CCOCC1
##c2ccccc2C
##c2n
cc1NC
ccc23
CCCC2
CCCCCCC
c5ccccc5
4O
Nc1ccc2c
##sccc
c2cnc
c6
##cnc3c
nc4
c3cccnc3
c2ncc
OCCC
CN1CC
c2ccccn2
2C1
Cc4ccccc4
CCn1
cnc2
NCc3ccc
##nc5
C1CCCCC1
5CC
NCCO
Fc1ccc
##1CC
c1cc2c
C1CC1
cc32
C1CCC
c2nc3ccccc3
##nc4ccccc4
##c2nnc
Nc1ncc
CN1CCC
##CCCC4
c3ccc4c
##c1cn
c2cccc3
CCc1c
CSC
N5
N2CCCC2
##CC3CC
OS
##O2
c2ccccc2Cl
N2CCCCC2
cccc1
CCOc1cc
c2cc3c
##N1C
c3ccccc32
c3ccco3
##c3c2
Cn2c
##CCCCC4
##CCN1C
N3CC
c2csc
ccc1OC
##2C1
CCCC3
Nc1n
2CCCN
cs2
oc2c1
##3CCN
C2CCCCC2
CC1C
c3ccncc3
NC4
cc3F
nc21
c3cccs3
Cc1cnc
ncnc32
1CCCN1C
Nc2c
c2ccccc2C
##N2
Oc1ccccc1
OCc3ccccc3
##n3c
NCc2ccccc2
cccc1C
sc2
43C
c4ccccc34
Cc4ccc
no2
##2ccc
c3ccccn3
cc1N
##sc2
1CO
sc2c1
Cc3cccc
##1CCC
##SCC
Oc2ccccc2
21C
1CCC
32
c1F
c1ccccc1C
ccn1
c1ccncc1
n1c
NCC2
n1cc
OCCCN
no
CN2CCC
CCN1CCN
c3C
C1O
##c5ccccc5
N4CCOCC4
C3C
CCCl
##1O
CNS
FC
Oc1cc
Oc2cc
c2c1C
N1CCCC1
COc1ccccc1C
CCc2ccccc2
N2CCCC
cc3Cl
12CC
c1ncc
n3cc
c1ccccn1
CCCCC1
##c1ncn2
N1CCCC
##c1ccc2c
nc2c
cc2c
N4CCN
N3CCCC3
CC5
nnc1
6O
oc2cc
##sc1
Cc1noc
##c1nc2ccccc2
c1ccccc1Cl
CCCC1
C1CCCN
Cn2cc
##c5ccc
OCc2ccc
n2cnc3c
##n3C
s3
c2cc1OC
c3cn
##n2cc
NCC1
nc2cc
ccc32
CCn1cc
##1CN
cc3C
##n12
nc1C
S1
c2ccccc2F
##2CC
OC3
##c21
ccc1Cl
N3CCCCC3
##2CCOCC2
c3n2
cc1S
1CCN
COC1
c1nnc
CCl
c2O
Oc1cccc
Cc3cc
##CCC4
##oc1
##CCCCN
c1NC
Nc2ncc
Nc1ncnc2
n3c
Cn3
CCCS
c1csc
5C
##CCS
C3CCCCC3
CCOc1ccccc1
c1cncc
5O
##2CC3CC
Nc2ccc3c
##c2cn
##c23
Cc3c
2CO
CC1CC
c1nc2ccccc2
##21
##5C
Cc1ccc2
NC1CCCCC1
Oc3ccccc3
##23
on1
c3cnc
##c6
OCC2
c2C1
c1N
##3nc
CCc1
##OC2
ccc1N
##c2ccccc2c1
##1CCOCC1
n2ccc
N1CCCCC1
CSc1ccc
COCCN
##nc2c1
nc32
c1nn
C2CCCN
cc3c2
##nc4cc
##CCC1
C4CC4
##s4
2N
##onc
##oc2
##3CC4
CC1CCCCC1
CN4
cc3c
##scc
##sc3
c2ccnc
##ncc4
c2ccccc2C1
Cc1ncc
cnc1
CCCn1c
Nc1nnc
CCN3
nc3c2
ccc2C
##CCCCCCCC
23C
CSc1nnc
CCCCC2
##o4
3OC
Cc1cc2c
NCc3ccccc3
CNCC
nc2ccccc12
Cc1ccccc1C
cc2C1
cc2O
##3ccc
CCCCCCCCCC
N1CCC2
C1c1ccc
Si
##S1
CSCC
C3CCN
c3ccccc3C
c3cccc4
NCc1cccc
o3
##cnc2c
##OC1
ccc1F
##O3
CCc1cccc
##nc23
Cc3
CC2C
c1cc2ccccc2
1c1ccc
Cn1nc
CCc2ccc
##c3ccccc3c2
c3ncc
CCC4
c2F
OCCO2
##CCCO2
CCCCO
c4c3
ccc3c2
3CO
CN2CC
c2ccccc2n1
CC1CCN
C1CN
ccc2n1
c2ccc3ccccc3
##c2nc3ccccc3
c1ccccc1F
c3n
NC2CCCCC2
##3c2
##CCCO1
cnc3
ccc5
COc1ccccc1N1CCN
OCCO3
c2cncc
Nc3nc
NC1CCN
c1ccc2ccccc2c1
CCc1nc
c2nnn
##c2ccccc2C1
c1cc2cc
nc2ccccc21
##ccccc6
ccc2O
NOC
c34
Cc1nnc
c2Cl
CCCOc1ccc
34
##S2
c2cc3ccccc3
##3CC4CC
##n23
sc
n3C
##c3cc4c
COc3ccc
##c1nc2c
Oc2c
c1ccc2nc
2CCN
CCc3ccccc3
##5ccccc5
c3ccc4
##nc21
CSc1nc
c3ccccc3Cl
ncn2
##c4ccccc43
COc1cc2
COCCO
CCSC
c2noc
Oc2cccc
##oc3
CCN2C
c2ncccc
CCCCCCCCCCCC
##1CCCC1
##cnccc
cccc1Cl
cccc2Cl
##3CCOCC3
c1ccccc1O
C2O
##c1ccccc1C
CSc2nnc
2CCCN2C
COc1cc2nc
nc2ccc
cccc4
nc3cc
cc2s1
O4
##3CCCCC3
CCOP
c5cc
cn4
##3ccccc3c2
Nc2n
nn12
3CN
##c3ccccc3C2
c1sc
CN3CCN
CNc1nc
c2nc3c
##NS
cc2OC
cc34
1CCCC
cc1Br
C6
nc2n1
NCCNC
nc23
c2nccc
Nc1ccccc1C
c2s
c2o
ccc34
oc12
c2nc3cc
##2CCCCC2
c1s
c2sc
Cc1ccc2nc
##4cnc
n1Cc1ccc
c3nc4ccccc4
Cn1cnc
c32
c2ncn
ccn2
c2ccc3nc
##1CCCCC1
##c2ncc
NCCc1ccccc1
c2ccc3ccccc3c2
oc2
Cc1csc
##3ccccc23
NCc1cc
##cccc1C
c1cc2
Nc4cc
c1ccc2cc
CC1CN
OCc3ccc
##2c1C
##c2ccccn2
c2nc3
Nc1ccc2
##4ccccc4c3
Oc3cc
c3ccccc3C2
C1OC
c2ccccc2O
2CCC
cc3OC
CO2
c2ccccc2c1
cccc12
##c3ccccc3C
##ncccc3
ccc2OC
c1cccc2ccccc12
CP
##c1nccc
##c1cnc
NCCc1ccc
ncnc21
7O
CCCc1cc
c1nc2c
N3CCCC
ccc2Cl
##nc1C
c3ccccc3F
nnc2
c1o
ccc2F
##3CCC
CCCN1C
oc
c2cnn
##ccccc45
on2
NCCCCN
Cc2ccc3c
c4nc
N1c1ccc
C4C
CCCOC
c4cnc
##CCOCC5
##cccc1
c1ccn
Oc1c
N1N
OCC1
Cn1ccc
Nc2nccc
##c3C
43
##ccccc13
COc1ccc2cc
CCN1CC
##c1nc2cc
SC1
c3cc4c
C2N
Cc1cccnc1
c3nnc
1c1ccccc1
c3ccnc
COc1ccccc1NC
3C2
##3CC
Nc2nnc
nc5
##n2c1
##2CCCC2
n2ncc
cc6
##c1nc2ccc
1C2
##CCCO3
CF
CCCC4
C1C2
n4cc
##nc2n1
CC2CC2
##sc3c
COc1nc
C3CC
Oc1ccc2c
##NC1
CCCCCNC
nc3c
CO1
Nc2ccccc2C
c1ccccc1NC
CCN1CCC
nc1N
##Oc2ccc
COc2ccccc2
N4CCC
NP
NC2CCN
12CCC
sc3
cc2n1
Nc3ncc
Nc3c
c3cncc
c4ccco4
C1c2ccccc2C
c3C2
c2cc3
Cc2n
c3ccccc3n2
c2nc3ccc
Nc4ccccc4
##occc
2NC
NCc2cc
##n1Cc1ccc
nc3ccccc23
c3cnn
##nc3c2
c1ccnc
CCCCCCCCCCCCCCCC
NCCS
c1c2ccccc2
c1cccc2
c2cccc3ccccc23
c1ccccc12
NCCCO
CCNS
Cc1nc2c
3N
CCCCCN
ccc1NC
CCCCCCN
ncn1
cc3C2
##4cc
cc1OCC
OCO5
CCCCCCCCCCCCCC
CC1CC1
NC1CCCC1
CCCCCCCCCCC
NCc1ccco1
##n5
##c2ccc3c
NC1CC1
ccc1OCC
c1nnn
C12
c2cc3cc
##CN1
c4cccnc4
Nc4cccc
##3CCCC3
CNc2nc
N4CCCC4
##C1CCN
Cc1nc2
C2CCCC2
Oc4ccc
NC1C
n1nc
S2
13
COCCNC
N4C
NCc4ccc
Nc1nc2c
OCc1ccc
n4cnc
n5
c1ccccc1C2
nn23
nc3ccc
n3nc
nn1C
c4ccccn4
##4CCOCC4
C1CCCC1
c1cnn
CCCCOC
Cc2cn
CCCCn1c
ccc3n2
OCc4ccccc4
NCC3
n3ccc
c3F
##nc4ccc
c5c4
c5cccc
sc1
##n2ccc
N2CCC3
CCCCC3
OCCCO
##1C2
cc2cc
Cc2cnc
CSc1
CSc2
##CN1C
CCOc1cccc
##c1ccccn1
C1c2ccccc2
##O4
NCc2cccc
C2CN
NC3CCCCC3
c2ccccc2OC
Nc1ncnc2c1ncn2
3COC
c3nccc
##2CN
C3CCCC3
CCc3ccc
c3nn
ccc3C
OCCO4
ncc1C
c4ccncc4
CCCc1c
C2CCC
##OCCO
##c5cc
c1ccccc1N
NC2CCCC2
OC4
##4ccc
nc2C
N3CCNCC3
cs3
##nc43
Cn1cn
CN3CCC
N1CCc2c
n1CC
CCCCOc1ccc
n2ccnc2
CSc2nc
3OP
NCCc2ccc
c1S
n2c1
##n3c2
cccc3Cl
##N2C
COS
Oc4ccccc4
##c1ccccc1Cl
n2n1
Nc4
cccc1F
n3cnc
##SC1
NC2CC2
Fc1cccc
Cc1ccccc1NC
cn2C
c2cc1C
c4nc5
sc1C
CSC1
COc1
n4ccc
c1C2
Clc1cccc
CC2CCCCC2
CCc1cc2c
##N1CCOCC1
##CCCC5
1ccc
n4cnc5c
Nc1nccs1
3CCCN
c1nc2cc
cc4F
##n1ccc
##4c3
##CCCCCC1
1CC2
2CCCC
Cc1cccs1
##c2cccnc2
Cn1ccnc1
NCc2ccco2
COc1ccc2nc
Nc1cccnc1
##c5c
Cn1ncc
##c3ccccn3
ncc2
c6ccc
OCc2cc
NCCc1c
##c1O
c1CC
##4O
##oc2c1
c3O
CCCc1ccc
Nc1nccc
c4cnn
c1ccccc1OC
cc3n2
c5c
OCc2
Sc2ccc
##CCCN1C
Cn2ccc
cccc3F
##CCCOc1ccc
c7
ccc2c
##CC1C
CCO2
Nc3ccc4c
c3Cl
nn4
CN2CCOCC2
##n1ccnc1
##sc2c
C2C1
##c2cc3c
NC3CC3
ncc1
Cn3cc
1COC
N1Cc1ccc
2c3cc4c
NCCc2ccccc2
2H
cc3O
N1CC2
c2ccn
SC2
##nc3ccccc23
c4cccs4
3COP
##ncn
##n3cc
c3cc4ccccc4
N4CCCCC4
##32
c2cc1
10
CCN2
c4ccccc43
##c3nnc
##n2nc
##CC1CC1
##6C
cccc21
##CCN2C
Oc2
Oc2nc
c2N
c2ccsc2
Cc1nc2ccccc2
COc1ncc
oc1
c3ccccc3c2
c1nc2
CCCCCCCCCCCCCCC
##2c3c
NCCN1
Cc2cccnc2
c2ncnc3
c1cnccn1
NCCOCCO
1CCCN1
c3c2C
Cc2nc
CCc1n
COc2cccc
##CCCCCC2
c2ccccc2S
C1CC2
c2c3c
c1nc2ccc
OC2CCN
c2OC
CC3CC3
##c3cn
12O
Nc1nc2ccc
n2cn
##no
##CCCCCC
c1nccc
Cc1oc
N1CCCN
cccc2C
Cn1cncn1
##nc32
N2CCNCC2
Cc1ccnc
CCc2c
##c1cc1
##nn1
CCCn1
cnc12
cnn2
Se
##c3cccc4
##N1CCC
##4CCC
CO3
c2no
NCCCCCC
##CC6
##N1CC
c2ccc3cc
c1Br
2COC
c4C
c3ccccc3OC
##n2ccnc2
CNc1ccc
cn12
oc3
n1cnc
n3n2
CNc2ccc
CC1CCC
c3ccc4ccccc4c3
COc1cccc2c1
##c1ccncc1
CNC1
3CCC
CN3C
Nc1nc2ccccc2
##sc4
##oc4
COc3ccccc3
OCOC
nc3ccccc32
##Oc2ccccc2
c3nnn
1CNC
c1c2c
##c1cc2c
c2ccc3ncc
N5CCN
Cn2nc
Cc1ccco1
Nc2nc3ccccc3
##5cc
CN2CCCC2
CCN2CCN
c1OCC
no3
##c4ccccc4C3
Cc2ccco2
cccc2F
##nc3ccc
CCOCC
ccc2O1
NCC1CCCO1
cc2NC
##OC3
##CCN1CCN
CCNc1nc
OCc2cccc
CCc1nnc
##4CCCC4
c1ccccc1S
##4CC5
CSC2
Cc1cc2
##C1CC
##CCOc1ccc
##nc2C
cccc2c1
CCCCc1ccc
CCc2cc
nc2c1ncn2
n12
co2
OCC3
CN3CCOCC3
CCn1nc
##1CC2
cc1CN
NN2C
N2CCCCCC2
##ns
##c2cnc
NCCN2
oc2c
NC3CCN
c2ncccn2
2c2ccc
sc4
COCCC
NC4CC4
c1CN
n2cccc
2c
##c1cccnc1
n2nn
COc2cc
CCCCCCCCCCCCCCCCCC
Nc1ccc2nc
c3ccsc3
CN2CCCCC2
Oc2ccc3c
##4ccccc4n3
OC1C
##C2CC2
C4CCCCC4
c2sccc
ccc43
ccc4c3
##c1ccccc12
##nc34
N2CCCN
CN5
C1c1ccccc1
##c1nn
c4ccc5c
Cc1onc
Cc4cccc
c1ccsc1
##6c
##CCN2
ccc3c
NC1CCC
c3ccoc3
c2nc3ccccc3s2
nc2N
CCCCN1C
c3nc4cc
##nn2
CCC1C
c4ccccc4C
C12CC3CC
##c5cccc
2C3
ccc2cc
##n1Cc1ccccc1
C23CC4CC
##sc2nc
##c1nc2
Nc2ccc3
##2ccccc2n1
O5
C3CCC3
NCc1ccc2c
ncnc2cc
##n1cnc2c
Nc1ccccc1Cl
nc2ccccc2c1
Cc2cccs2
oc2ccc
N5CCOCC5
C2OC
cc43
CCc3c
2O1
Brc1ccc
##nnnc1
cc3s2
6C
COc1cc2ncnc
##nc2ccccc12
cc4c3
oc3c2
OCCOC
##4CCN
n2CC
Nc1nc2cc
SCc2ccc
cccc23
N2CC3
Cc1ccc2ccccc2c1
##c1c2c
##cncn2
Cc5ccccc5
OCCCCC
Oc3c
c5ccccc45
CCCc1ccccc1
Sc2ccccc2
C1CCS
##n1CC
nc1O
##3cccc
CCN2CCC
34C
c1noc
cnc
##c3n2
cc13
1CS
NCc1cccnc1
ncnc43
CCCN1CCN
c1cccc2c
23CC
sc2n1
NC1CC
Nc1cc2c
NCCCCC
##c1cc1n
CSc1ccccc1
nn2C
c3ccccc3O
##N1CCCC1
##c3ccncc3
c1cnc2c
COc1cc2cc
n1Cc1ccccc1
##4nc
ccn3
##nc2N
NCCCNC
##1OCCCN
##CCOCCOCCOCCO
Nc2nccs2
CBr
C1Nc2ccc
c2ccccc2N
CCc1nn
ccc3OC
noc2C
1cccc
CCO1
2ccc
n1ccc
##nc1O
C2C3
COc1ccccc1CN
n3ccnc3
Cc1cnn
N2C1
N2N
##c1cncc
CCN3C
cc1NS
##C4
N4CC
OCc2c1cc1n
Cc4
nccc
##oc3cc
cnc1C
c1sccc
Cc2ccc3ccccc3c2
CNc1cc
Nc1ccccn1
ccc2N
N1CCc2cc
Cc1nc2cc
c2cnccn2
nnc3
##CC2CC2
ncnc2
NCC2CCCO2
CN1CCC2
CCCN1
NN1C
##CCN1CCC
Cc4cc
ccc2o1
##ccccc21
##c2c3c
NCCc3ccc
2cc
nc2c1c
nc2s1
CCCCS
sc3c2
##occ
nc3n2
Nc5ccc
c3ncccc
COc1cccc2c1C
CN1CCOCC1
Nc1ccn
##c3ncnc
1Cc2ccccc2
##c1ncnc2
##Nc1ccc
COc1cccc2
CN2CCCC
3CCC4
NO1
##4CC5CC
C2NC
Cc1ccsc1
COc1ccccc1CNC
c3ncccn3
##2C3
31
##4CCCCC4
NCc1c
ccc3O
CNC2
N12
Cc1sc
NCc3cccc
##sc1C
1cc
Nc1ccccc1F
NC12CC3CC
##scn
N1c2ccccc2
CN1CCCC1
n3cnc4c
NCCN1CCOCC1
##CC2C
CN3CCCCC3
Oc3cccc
c1nc2ccccc2s1
NCc3ccco3
Cn2ccnc2
##CCCCC5
ccc1Oc1ccc
c4cn
cn3C
NC3CCCC3
nc3ccccc3c2
Cn2cnc3c
c3cccc4ccccc34
N2CCc3c
co1
##noc
##oc2cc
CCCc2ccccc2
c4n3
c1ccccc1Br
ccc3F
c1cccc2c1
CSc1n
##ncccc2
Cc1cc2cc
N1Cc1ccccc1
c6ccccc6
##cccnc23
##C1CC1
Cc3ccc4c
##4CC4
c4ncc
ccc2C1
CCCCCO
OCCNC
C2CCC2
c2nccs2
##c3nc4ccccc4
##c2ccncc2
CN3CCCC3
n3c2
COc1n
Cc3cccnc3
4OC
Cc1cccc2ccccc12
Nc2ccccn2
NCCc3ccccc3
Nc2ncnc3
C21
##c1ccnc
c3ccccc31
COc1ccccc1N
CCCc1nc
3CCN
##c1c2ccccc2
C3O
##5ccccc5c4
##c1ccnc2cc
COCCn1c
c3csc
cc2o1
CN1CCCCC1
nc2n
cn23
ccc5c4
Cn1cnc2c
c3noc
C4CCN
##n4cc
cn1C
##2cccnc12
##c6ccccc6
CC1C3
c2cnc3c
Nc3ccccc3C
2CNC
Nc2c3ccccc3
##n1nc
ccc3o2
13C
c3OC
cc2N
Cc2ccccc2F
CC1CCCN
CSc1nc2ccccc2
c2cccc3c
Nc2ccccc21
C1CCC2
oc2ccccc12
Cc1nc2ccc
35
32C
CSc2ccc
Cc1ccncc1
SCCC
ccc3Cl
CN1CCCC
##nn3
n3ncc
n1ccnc1
C1c1cccc
CN2CCC3
##nc6
OCCCCN
##c1ccc1
c2ncnc
cc2c1O
24O
C3CCCN
##c7
c4ccccc4F
C1CCC1
Clc1ccc2c
NCCN3
NCc1ccccn1
n1ncc
Cc1ccccn1
CSCCC
c1cn2c
cc1C2
CCOCC1
##2oc
c3ncnc4
ncc3
c2oc
nc54
Oc1nc
##CCCCC1C
Cc4c
OCc3c
CCOc2ccc
##c3ncc
cc2c1C
CCCN1CCC
c13
##3ccccc3n2
SCc2ccccc2
24OO3
##oc2c
c2cn1
1c
cc2N1
##c2ccccc2c2cc
N3CCCCCC3
##4ccccc34
##c3ccccc3c
cccc3C
CCCCCCNC
cc4CC
cc4Cl
C5C
C5CC5
##c3cccnc3
2c2ccccc2
##6CC
NCc4ccccc4
Nc3nccc
nc2c1C
C4CC
CCNCC
N1c1ccccc1
c1cc2ccc
c2cs
Nc1cn
nc3C
11
Cc1ccccc1N
Nc1cnc
C7
ccc1Nc1ncc
CCn2c
Cc1ccc2cc
CC3CCCCC3
##SC2
CCO3
CNCCN
CCCN2C
c1coc
##S3
ccnc2c1
c4O
c3ncccc3
##C1CCCCC1
Nc2cn
cnn
c4cncc
Cn1c2c
##c2ncnc
##ccccc32
cc2nc
CS2
NC5
oc3cc
CC1c1ccc
##NC2
Nc1ccncc1
NCc2ccc3c
Sc3ccc
CCOc1ccc2c
##CCN1CC
##CCCCCC3
CCCc3ccccc3
oc4
c2cc3nc
OCc1cc
Cc3ccco3
OCc2c
Cc2ccncc2
Cc2ccccn2
##onc1
NCc2cccnc2
c2s1
C1c2c
1Cc2c
cnc23
##5ccc
OC2C
##n2Cc2ccc
N1CCCCCC1
##OP
nc3ccccc13
CCOC1
c1ncnc2
ccc45
2c3cc
##sc4c
c3ncnc
##c34
c3ccccc3S
cc4c
Cc2ccccc2Cl
CC2CCN
SCCN
nnc12
c3ccccc13
c2ccccc2Br
c2ccccc2C3
Cc1cc2nc
6CC
##5c4
ncc12
##n2CC
ON
Cc1cncc
cc4C
##2S
c2cnc3
c1ccoc1
COC2
CC6
c2c1O
Cn3c
s4
##c1ccccc1F
n3cccc
45C
Nn1c
CON
##CCCCC2C
ccc2ccccc12
NCCN1C
CCCCc1nc
Nc2ccccc2Cl
OC5
C3CCOCC3
Nc2cccnc2
cnc32
C2S
Cc3ccccc3F
c4nc5ccccc5
ccc3N
cnn1
n2cccc2
##2ncnc
ncn3
NCc1cccs1
Oc4cc
##cnnn2
cc3o2
c4ccc5
CCOc1ccccc1NC
##sc2c1
2CN1C
Cc2nnc
NCCCCCCCC
COCc1ccccc1
CCCCCCO
##c3ccc4c
OCc3cccc
c3s2
NCCCCCN
nnc1SCC
##Sc1ccc
Nc1sc2c
c1cnc2ccc
o4
##c4ccccc4C
c4ccccc4Cl
##4CC
OCc4ccc
CCC1CC
CNc2cc
COCc2ccccc2
45
##NCC
c1nccs1
Cn2cn
NCc4cccc
Nc1ccccc1NC
1Cc1ccccc1
3CCCC
NCc2c
C12C
se
CCNCC2
CC4CC4
4CN
3c4ccc
Oc1ccc2
OCC2CC2
##sccc3
##Sc2ccc
cccc32
Cc2ccccc2C
cnc2c1
C2CCCN2C
N2c2ccc
N2CCc3ccccc3C2
N4CCNCC4
C1CSC
1ccccc1
COCc1cc
##n2Cc2ccccc2
c1cc2ccccc2o1
CCCCCCCCN
##2CCC1CC2
c3cnccn3
Clc1ccccc1
##c3ccccc3n
3CNC
NN1
##sc12
c1oc
##c3c1O
COC3
N6
##c1cccc2ccccc12
CCn1ccc
sc12
##CCO2
##c4nc
Nc1nc2
c2cnn3c
Sc1nnc
##5ccccc45
CCOCCOCCO
Nc1cccc2ccccc12
##ccccc7
Nc2nc3c
1c2ccccc2
cc3CC
##C1O
COc2ccc3c
c2O1
##N1CCCCC1
CN3CC
CSc2nc3ccccc3
8O
N1CCO
Cc1ccc2oc
CSc1cccc
ncc2c1
Cc5ccc
CNCCCN
C2c2ccc
c2cc3ccc
Nc1cc2
Sc1ccc
CNCCC
C1c2cc
CCOc1c
cccc5
##N2CCOCC2
n4C
##ncccc4
1Cc1ccc
cc1Nc1nc
CNCC2
CCCN1CC
##cc2
CC3C
Cc1cccc2
Nc3ccccc32
##c2nn
n2Cc2ccc
##c2sc
##c3c4c
CC1CCCC
c2ccccc23
NCCN2CCOCC2
cnc21
##1CC1
##c2cc1OC
COCCCNC
Clc1cc
CCN2CCOCC2
C3CCC
##c4cc5c
##nc54
18
2Cc3c
CCOCCO
##C1CCCC1
oc1C
Cn3cnc
OO
NC2C
##ccccc24
c2ccccc2NC
N3CC4
cccc2C1
NN2
N3CCC4
Cc2cccc3ccccc23
##c2nccc
NC1c1ccc
c4ccccc4C3
C1CO
NCCCCNC
N1CCc2ccccc2C1
Fc1cc
##nc4c3
cc3c1
##CC3CCC
##ncc5
c4ccccc4c3
nn3C
##1N
##oc3c
nc2nc
##CCNC3
C2CCNCC2
c3ccn
SCc3ccccc3
OCCCCO
C4CCCC4
C1C2C
12CO
cccc4F
1N2C
Cn1nnc
COCCOC
COCCCN
C1c2cccc
CN1CCCN
NCC3CCCO3
Cc1c2c
##n1cn
CCOc1ccccc1C
C23
##c2ccccc2N
c2ccoc2
NCCc2c
##CC3C
##nc2ccc
C1C3
##OO4
CCC2C
c2c1CC
3NC
c1ccc2ccccc2n1
Cn2nn
Fc1ccccc1
Oc3
2CS
##CCN1CCOCC1
OCc3cc
C1CCOCC1
n2cccn2
SCc3ccc
c1c2cc
CC12CCC
CS1
c2nc3ccccc3c
CCc4ccccc4
ccc2N1
c2c1CN
Nc3nccs3
COc1ccccc1O
CCCOc2ccc
NCCCCCCN
CN4CCN
4CCC
n1cn
##c2ccnc3cc
NCCCN1CCOCC1
##c1ncn2C
oc23
nc34
OCCCCCC
1c1cccc
Cn1c2ccccc2
c2cn3c
##n4C
c1ccc2oc
c2ncccc2c1
oc2C
1O2
cn2c
C2c3ccccc3
##CC2CCC
c3cc4cc
##ncc3cc
C1NCC
##CCOC3
cncc2
c4ccoc4
c2cc3ccccc3o2
65
##c3n
CNCCCC
C1S
Cc1sc2nc
##c1noc
NCc1ccccc1Cl
4C3
c43
COc1cnc
cc1N1CCN
##ncn1
COc1cccc2c
1CCC2
4CCCN
C12CCN
##OC4
##3CCNCC3
COCC1
NCCSC
##nc3n
##1CCNCC1
##Oc3ccccc3
c2cccc3c2
1c1cc
##Oc1ccccc1
##6ccccc6
CCCCCOC
sc2C1
ccc2c1C
Cc1cccc2nc
3cc
C1CCCC
n21
##Oc2ccccc2O1
CCCCCc1ccc
ncc23
CCP
SCCO
CCc1nc2c
c2cnccc
c2cnc3ccc
c3ccccc3N
C3C2
CCNc1cc
CC2CC
ccc13
C1Nc2ccccc2
Cc1ccccc1F
Cc3cccs3
Cn3ccnc3
ccc31
CCCn1cc
nc43
##2n1
##Oc1cc
C3CCNCC3
##5CCOCC5
CCn2
c4nccc
##n34
CCc1ncnc
c3ncccc23
##nnnn1
Cc2cc3c
CCc2cccc
CNC3
##CCOC2
Cc3ccccn3
S3
N2CCOC
OCCCCCCCC
4N
##c2ncccc
c2c1c
N5CCC
c3cccc4c3
cnc2N
CN4CCOCC4
##ncc1C
##NC3
c1ncccc1C
CCNC1
CCNC2
c2o1
CNCc2ccc
N2c3ccccc3
##n3ccc
Cc2csc
5OC
ncnc54
Cn1cncc
NC2CCC
NO2
Nc2ccccc2F
Cc1cccc2c1
CCSc1nnc
COc4ccc
c3c1
##CCNS
##2OC
CCc1ccc2c
ccc2n1C
c1CNC
Cc3ccncc3
CN2CCCN
Nc3ccccc3N
c1oc2ccccc2
OO1
ccc3C2
c1ccc2ccc
CC1OC
CCN3CCOCC3
ccn
ccc2s1
##CN1CCN
CCN2CC
c4ccnc
c3nc4c
Nc1cncc
on3
##CCOC1
Oc1cc2c
C1CCCN1C
##12CC3CC
##CCCN1CCN
##nc2cc1OCCCN
Cc3cnc
Cc2ncc
c2ncccc12
cc2Br
C2CCOCC2
n1cnc2c
NCCOC
N3CCCN
NC2CC
Oc4
CCF
c1CCC
CCNc1ccc
NC23CC4CC
CCc1ccccc1NC
##c2ccccc12
c2ccccc2S1
COc1ccc2nccc
n2nccn2
##1S
c3o
N2Cc3ccccc3C2
CC12
##C2CCCCC2
NCCC2
cc3cc
N1CCc2ccccc21
##sc3ccccc23
N2CCc3ccccc32
c1C1
cc45
c3nccs3
sc2nc
cc1C1
CCCCC4
CCCCCCCN
Cn
COc1cc2c3c
SS
Cc1ccccc1OC
sc3n2
2N1C
cnc2c
NCCC1
CCN1CCOCC1
##oc2ccc
##Sc2ccccc21
OCc2cn
Cc2ccccc21
ncnc12
cnc1N
1C1
##nn4
c2cncnc2
Cc1cccc2cc
NCCN3CCOCC3
NCc1ccncc1
##CCCN2C
##c8
COc2c
CCCCCCCCc1ccc
Nc3nc4ccccc4
sc2c1CCCC2
##N3
##nnnc1C
cn2c1
c1cc3c
CCN1CCCC
CCN1CCCC1
##2CCNCC2
CNc3ccc
n2cncn2
##1NC
c4nnc
54
##o5
c3ccc4ccccc4n3
Nc3ccc4
Sc3ccccc3
OCc5ccccc5
CSc1ncc
N1CCNCC1
OCCCNC
##c2nnn
Cc1nccc
2COP
cc2n
##sc3c2
COCCN1C
CN1C2CCC
c3nc4ccc
##n2c1C
ncc3c2
Sc1nc
##CCN3
CC1N
Cc1ccccc1S
Cc1ccccc1OCC
##c3cnc
c3nc4ccccc4s3
ncnc1
cc2c1OC
c6cc
5CCCN
cnn3
1n1cc
2CC1
3Cc4ccc
NCc2ccccn2
Nc2ccc3nc
Nc1c2c
Nc3ccccn3
c1cnn2ccc
Oc1ccccc1C
1c2ccccc2C
CCCCCS
##c1nc2ccccc2c
Cc2nc3ccccc3
1c1ncc
##n3cnc
Cn1nnnc1
CCN3CCC
N1CC1
CCOCC2
OCCF
Cc1ccccc1Cl
3C4
N1Cc2cc
OCc1c
NCCCN1CCN
noc1C
cccc4Cl
c2coc
2OCC
ccc6
ccc3ccccc23
NCCCc1ccccc1
c2nn3c
Cc6
NCc2cccs2
Cc3ncc
##ncnc
ccc1S
c5cccnc5
c3c4c
CCOc1nc
Cn2cncn2
c1ncn
Nc2cccc3ccccc23
OCC1OC
Cc3ccccc3Cl
ncc1Cl
1ccn
##cnnn3
COc1ccc2oc
Cn1nccc
1CN2CC
##ncccc2c1
C1CCc2cc
Cc2cc3ccccc3
##on3
n2N
##cnnn1
c4nc5cc
Cn3cncn3
6OC
Nc4c
Nc2ccnc
##CCN1CCCC1
cc2O1
n2Cc2ccccc2
Nc5cc
N21
Cc1cccc2c
CCCCCCCCCCCCCCCCC
##2O
ccnc2cc1OCCCN
nc2cccc
Nc3cccnc3
nnn2
OCC4CC4
nc3cccc
##CCN1S
CCOc2ccccc2
ccc1N1CCOCC1
OCCN3CCCCC3
n3cccn3
SCCCN
N1c1cccc
1CCNC1
N1Cc2ccccc2C1
ncnc3
##SCC1
CC1CCCC1
##c1ccccc1OC
c2nnc3n2
NCc3cccnc3
sc4n3
##ncccc12
Nc2nc3ccc
N2CCO
##c3ccccc3CN
CCCCn1
nc2C1
NCCCNCCCCN
c2n1C
cccc13
##n3ccnc3
CC2CCCC2
C3CN
c3cn4nc
3CCCN3C
N2CC2
C3N
ccc3nc2
C1Cc2c
cc1CNC
##CCN1CCCCC1
CC2C4
CNCc1ccc
COc3cccc
ccc3cc
C1CCc2c
NCc1cn
cc1I
##CCCO4
c8
C1c2ccc
c4noc
##CC1CC
n2nnnc2
Cc1occc
1CSC
OCCS
Cn1cccc1C
NCc2ccncc2
7C
Cc1ccccc1O
##s5
##nc2n
cc1OC1CCCC1
n4c
##2CO
CCOc1ccc2nc
nn2c
##c2nc3ccc
ncc2C
34O
1CCO
n2cnnn2
NCC1CCN
NNS
Nc1nc2ccccc2s1
N4CCOC
OCCO5
c3ccc4nc
c4nn
CCNc2nc
NCCCN2CCOCC2
COCc1ccc
c2ccc3ccc
c2cccnc12
CC1c1ccccc1
Cc1cc2ccccc2
cccc2n1
##cccnc34
OCc1cccc
NCc3cc
##c1ncccc1C
14
Cc3nc
CSC3
CSSC
ccc1OCc1ccccc1
OCCN1CCN
##cnccc3
sc2cc
##c3sc
c1ccc3c
C2c3ccc
c1cc2nc
c1cs
Nc2ccnc3cc
Li
cc4C3
cc2S
##CCCOc1cc
n3cccc3
Oc4cccc
##oc1C
##c2cnn
Nc3ccnc
##Oc3ccccc3O2
##oc12
nc2sc
cc4s3
##cc1
CCc1cn
n1N
C5CCCC5
1n
##6cc
Cc3ccccc3C
CCCCCCOc1ccc
c45
OCc1cn
N1C2
nc2O
Nc1cccc2
##c2ncn3
NCCCCCCNC
1SC
CCCCCC2
NCCCn1ccnc1
Nc3nnc
2c1
##Oc1cccc
n2ncc3c
CCN6CC
c3c2c1
C34CC5CC
2OP
##nc4ccccc34
c3cncnc3
C2c1ccc
CCCOc1cc
c1sc2ccccc2c1
3c3ccc
nnc
c2nc3ccccc3o2
##nnc2ccccc21
cc2c1N
c2ccc3ncnc
##ccc1
##CCNc1nc
cc2oc1
##C2CCN
NC1CCCCCC1
C2CCS
##nc5cc
cccc1NC
Sc2c
NC4CCCC4
CCCC5
##nc5ccccc5
c1c2ccccc2nc
CCN3CCN
nc1NC
N2CCS
Sc1ccccc1
##c4c5ccc
CSc1cc
##ncccc3c2
##oc4cc
cn3C2CC2
nc4c3
sc2C
C2c2ccccc2
1CCc2c
n3ccccc3
Nc2c3ccccc3nc3ccccc23
c4ncccn4
OCc3cn
CC1O
NC1CCS
##nncc
c2ccccc2N1
CN1CC2
N4CCCC
NCC1CC1
Nc2ncc3c
CSc1nc2c
2Cc2ccccc2
nc2sc3c
NCCCl
N1O
Nc2ccncc2
c2cc1Cl
5CCCN5C
c3nc4
CCCCCn1c
ccc1Br
c3ccc4cc
c1ccccc1OCC
CCCNS
c1oc2ccc
##c2nc3c
CSc2ccccc2
CCCCc1c
##c4ccncc4
c2nonc2N
CCc1nc2ccc
COc1ccc2cc3
cc1CC
CSc3nnc
Cc1cn2c
Nc2ncnc3cc
##nc1N
35CC
c1ccccc1S2
C2C3C
18F
3c
n2nccc
C1CCNCC1
c2nnnn2
Cn4cc
Nc2ncnc
sc2ccccc12
c1COc1ccc
noc3C
##n3nc
OCCCO2
c3o2
##c4ccccc4c3
c2cccnc21
n2nnc
n2cnc
noc4
##c2cnn3
Cc3cn
CC2CN
NCCC3
CCc1cnc
Cc1nccn1
Cn1cncc1C
COC1C
ncc4c3
cn3c2
N1CCCc2ccccc21
##SC3
c3c2CCCC3
c3sc
c3nc12
##CC1CCCCC1
1CCOC1
COc1ccc2c3c
3ccc
c5cnc
COc1ccc2c3c1O
CCN3CC2CC2
Cn3nc
N1CCC1
OCCOCCO
nn2c1
Cc2nn
cc31
Cc1coc
##c2cccc3
c3ncn
1F
##sc2ccccc12
##cnccc12
Nc1ncnc
NC4CCCCC4
##c1ncccn1
##CCN3C
##CC1CCN
CCCCCOc1ccc
##CC4CC
ccc4C
23O
nc2cnc
##CCO3
12OC
2n1
7CC
CN1CCc2c
##n2c3c
N23
##c3cccnc32
Oc2ccccc21
##oc3ccc
OCc4cccc
CCCCc1cc
OCCN3CCOCC3
NCc3ccc4c
CCN3CC
cnn1C
nn3c2
1C3
##ncccc34
ncnc2cc1O
3c3ccccc3
##c1ccco1
CNCCO
c54
CCSc1nc
CCn1c2ccccc2c2cc
cc2ccccc21
CCN1CCC2
ncc2Cl
##c3cccc4ccccc34
c3oc
Cc2ccsc2
Nc1ccc2oc
coc2c1
##c2ccccc23
##C2CCCC2
c4ccccc4OC
cn5
cnc3c2
c2ncccc2C
Cn1ncc2c
CO4
CCCCCN1C
C4CCC4
c1Cc1ccc
nnn1
CCc3ccccc32
1COCCN1
nc4cc
2Cc3ccc
##5ccccc5n4
C2SC
c4F
c1ncccn1
Oc5ccccc5
ccc2N1C
c2cccc3cc
c5C
cnn2C
c1onc
##C3CC3
ccc4F
cccc34
CNc1cccc
CC2C3
CCCCCn1cc
c1ccc2ncc
COc1cncc
3H
Brc1cccc
COc1ccc2ccc
2cccc
4CCCC
Cc5c
ccc3n2C
ccc4n3
Cc1nc2cccc
1S
csc1
CC12CC3CC
CCNCC3
C1CS
CCc1ncc
##c2cccnc21
##n2cn
##CC1CCCO1
C1COc2ccc
c1csnn1
##4cccc
cc3c21
Nc2nn
c2sc3nc
c2cnc3cc
CCN1CCCCC1
Oc3ccc4c
OO2
SSC
##OCC2
CCCCCCCCNC
c2c1OC
##CCC2CC3
c2cccc3cccnc23
Nc1ncnc2c1c
Nc1sc
Cn2nnc
CCc1noc
CC2C1
n2c1C
CI
COc1cccc2cc
nc3c2C
c4cc5ccccc5
OCC3CC3
2SC1
C2SCC
##nc2c3c
CCNC3
OCc2nnc
cc2ccc
n1cccc1
Cc1ccccc1N1CCN
N1Cc1cccc
##sc23
##c5ccccc54
c2ccc3ccccc3n2
##c1cnn
NC3CCC
OCCC2
CN1Cc2c
cc54
1CCCCO
OC3CCN
cc2C2
##c2ccccc2n1
##c1cc2cc
COc1ccnc
COc1ccccc1CC
cnc2C
1c2cc
##cc1C
##c1cc2
c2c1N
##c1nc2ccccc2s1
Sc2cc
oc3C
##4CCC3
Cc1ccn2c
N1CCc2nc
CCC12
c1ccc2c3c
OCCCCCCCCCCCC
cnc2n1
N5CCCC5
c1nc2ccccc2o1
c1cc2ccccc2s1
##c1sc
CC1CCC1
CCCN2
sc21
cc1Nc1ncnc2c
##Oc3ccc
2Cc2ccc
##c1nn2c
N1CCn2c
CC4C
Nc2nc3cc
c5nc
COc1cn
CCn1ncc
CCCSc1nc
c1sc2nc
SCC2
##3oc
cc2oc
##CCCCO
##CCCCCCN
CCCc2ccc
ccnc2
CC3C2
COc1ccc2nc3cc
##sccc4
N1CCCC1C
1n1cnc2c
##nc2sc
1Cc2ccc
Nc2ccccc2N
Cn3ccc
Nc3ncc4c
c4cccc5
##oc2ccccc12
##SCCC
c3ccccc3Br
c3cnc4ccccc4
C1Cc2ccccc2
3CCc4cc
2CCCN2
24
c24
CCOCC3
ccc2NC
cc4OC
C4CCOCC4
c1NS
cc2nc1O
CCC1CN
ccn4
c2ccnc3cc
CCOCCCNC
COc1ccccc1C1
##2ccccc21
nc4ccccc34
COc1ccc2ccccc2c1
##CCOCC6
##OCCO2
1Cc2cc
CNCc2cccc
CCCNc1nc
Cc3cccc4ccccc34
c1nnnn1
NCc2cn
N1S
Nc2cncc
N1CCOC
cccc2s1
c3cc4ccccc4o3
c1scc
NC3C
##c1ccc2
cc2c2cc
c1cccc2cc
C1Cc2cc
Nc1ccccc1OC
c2nc1
##c3ccccc3n2
CCCCNc1nc
##ncccc4c3
CCCCCCCCCCCCCCCCO
Cc1nc2ccccc2c
NCc3ccccn3
n2CCC
##c3ccccc3nc
c2cccc3cccc
##c3ccccc23
1CCCCN1C
NCCCN2CCN
CNc1ncc
##c2ccccc2c1C
ccc3N2
N1CCc2
N2CCC2
N3CCc4ccccc4C3
##N2CCCC2
##sc2C
CCC5
CCCN2CCN
N2Cc2ccc
c2cnn3
N5C
##nsnc12
c1c2
OCc2nc
cc2n1C
NCC1C
nc4ccccc24
Oc3ccnc
2c3c
NCCCN3CCOCC3
oc2c1C
n2cnnc2
OB
##n4c
##ncn2
##n32
CCCCCCc1ccc
nnc1C
Cc3n
##SCCN
SCc2cccc
CCSCC
OC2CCCC2
cc7
##CCCCC3C
ccc1N1CCN
4CO
Nc6
##c2cccc3c2
2S
CCc3cc
##c3nnn
Nc3ccccc3F
2CNCC
CCn1cn
scc
##c2nc3cc
##c1ccn2
cc1CO
nc2cc1C
c2cc3ccccc3oc2
cccn2c1
1C5
CSc1nc2cc
c3c2F
c1oc2cc
n1nccn1
2c1ccc
##Sc1ccccc1
c1cccc2c1C
##nc3cccc
Nc1cccc2c1
Nc4ccc5c
nc4ccccc43
##on1
##CCCCCCC2
NCCN1CCN
C2c3c
cc3nc2
##12CCN
COc1cc2oc
##ccccc43
Cc1ccsc1C
3CCCN3
OCCN4CCCC4
CCCCCCOC
##c4cn
N1Cc2ccccc2C
23c4c5ccc
ccc1OCc1ccc
CCCCn1cc
1O5
1OP
NCCCN1
CCCCCCCCCCN
oc3ccccc23
##3c4c
Nc1ccnc
Nc5ccccc5
CNCCNC
c4Cl
Nc1ccccc1Br
OCc2ccc3ccccc3n2
Cc2nc3cc
CCc4ccc
##c3c1
C2CC3CC
CCCn2
n1NC
NCC4
nc3n
OCCN3CCCC3
##OCCO3
n1cncn1
##c3nccc
c2cc1O
Cc1nn2c
C5CC
NCC2CC2
Oc2cnc
##c1c2
cc3c2C
CCCCCCCCO
##N2CCCCC2
N2CCCC2C
c1nc2cccc
Nc1ccc2ncnc
##7C
N1c2ccc
##CCc2ccc
NC1CN
CS3
2Cc3ccccc3CN
CCCN3C
CCOc1cc2c
c2nc3cccc
CONC
c3ncccc3F
Oc3nc
c4C3
CCCN3
cc5c4
c5ccccc5c4
NCC1CCCCC1
CN4CCCCC4
c3sccc3
CCCc1cccc
##CN1CCC
NCCCOC
CCOc1ccc2
Cc1cnc2c
CSc2nnn
cnc3cc
c2c3nc
CC1CCCO1
c2ccnc3
c3cc2
COc1ccccc1OCC
Nc3ccccc3Cl
##c2nc3ccccc3s2
nc6
c1cnc2ccccc2c1
CCCOc1cccc
OC2CCCCC2
CN4CCCC4
c5ccccn5
Cn1cnc2cc
Oc2ncc
##7c
##CCc1ccccc1
CCN2CCCCC2
c1ccccc1C3
Nc1ncccc
##c4ccccc4n
Cn1cc2c
NCc3cccs3
c2sc3ccccc3
CCOCCOCCOCCNc1nc
nc3ccccn23
sc2c
c4nnn
12CCCC
N2CCCc3ccccc32
N5CCCCC5
2n
cnc4
##c2cncc
OCP
CC2CCCO2
##nc2c1ncn2
Nc1ccc2ccccc2c1
n1cnnn1
n3cnnn3
##1CCC1
nnc3s2
##c3nc4cc
CCNCC1
c1cccc3
CC3CCCO3
c2ncccc2
##1CNC
Cc3ccccc32
##c2c1C
N2CCc3cc
c4csc
Cc3ccsc3
4CCCN4C
c3s
##c1ccccc1c2
1OCC
N1Cc2ccccc2
c1cc2ccccc2oc1
##ncc3c
CCCN2CCC
Nc1ncn
ccc1NS
1CCNC
2ccccc2
COc3cc
ccnc3
CC2CCC
n2nc3c
CCCCCCCNC
CCSC1
OC1CCCCC1
##c1nc2ccccc2n1
CSc1nc2
11C
c3cccn3
c1ccccc1NS
##CCO1
n1C2
NCC2CCN
##3cccnc23
##2CCCC
CSc1c
cnn12
##N2CC
COCCOc1cc
##CCCCCCNC
##cnn2
Cc1ccn
ccc2S
##c3ccnc4cc
N3CCS
##5CC6
cc2nc1
##c3ccccc3N
c3ccccc3S2
Nc1ccc2cc
CN3CCCC
NCCCCN1CCN
c2oc1
##c3cnn
n2ccccc2
c2c1CCCC2
c3cccc4c
N1CCCCN1CCN
c2Br
c1cccc2cccnc12
CCNC4
c3N
CNCC3
NCCN1CCCC1
CCCCCCCCCCCCN
Nc2cc3c
OCC2C
O6
CCBr
ccc4c
NCCc1cccc
N3N
c4ccccc4c3C
c2cn3cc
Nc2ccccc2OC
OCCN2CCOCC2
c2oc3cc
##Nc1nc
NCc1nc
12CCN
Cc1nnc2n1
C5CCN
Nc3ccon3
ns2
CCCCCc1cc
NC1CCCN
c1cnc2
c4ccsc4
Cn4
c5ncc
ccc2c1O
CN1CCc2cc
##c1cnn2
noc1
CN4CCC
n1Cc1ccco1
##9c
##OCO3
CN12
SC3
c2sc3ccccc3c2
cc1Nc1ncnc2cnc
C2CCCO2
##c1ncccc1
Fc1ccc2c
##Sc1nnc
c1cccc2nsnc12
n2cnc3cc
oc4c3
4NC
Oc5ccc
C2CC3
n4ncc
N1CCCC2
##cnccc23
1COCCN1c1nc
##c2ccccc2Cl
COc1cc2nccc
c2oc3c
NCCOCCOCCO
NCCOCCOCCNC
c2sccc2
NC1CCCc2ccccc21
nc2N1
1CCc2cc
c5cnn
N4C3
NCC2CCCCC2
OCCCN3CCCCC3
COc1c2c
nc3ccccc3
c2coc3cc
CCO4
N2Cc3ccc
CCCCCC1
c2c1cc
C1CCCO1
##OC1C
CC2SC
NCCCn2ccnc2
C1Nc2cc
1CC3
2F
C1c1c
C1OCC
##c1cc2ccccc2
1C2C
c1ccnc2ccccc12
SCc2cc
c1sc2cc
314
c1c2ccc
##4c5ccccc5
NCCNCC
OCCN2C
C1CCCN1
Nc2nc3ccccc3s2
##nsnc23
cc1CC2
NCCN4CCOCC4
##CCOCCOCCO
c2oc3ccccc3c2
cc3O2
N1CCc2ccc
CN4CC
OCC1C
CN1CCc2ccccc2C1
sc3nc
CNc2cccc
1C2CCC
c1ccnc2
N3C2
##ncc2c1
c1cnco1
N2CC3CN
##cnnn
CCS2
1c2c
OC1CCN
NC2CCCCCC2
c2ccc3nnc
OC1CCCC1
Cc2cc3cc
CCCCOc1cc
n23
COc1cccc2ccccc12
CCCOc1ccccc1
NCc2ccccc2Cl
Oc1cccc2ccccc12
1CCCN1S
Oc1
##CCCN1
CCOc3ccc
CC3CCCC3
C4O
C1COc2ccccc2O1
N2Cc3ccccc3C
Sc2nc
NCc3c
cc2NC1
Nc2sc3c
c1cnn2c
23CCC
##sccc23
c2nccnc2
CCCn1nc
CN5CCN
CSc1nc2ccc
ccc2oc1
CCCOc1ccc2c
Nc3ccncc3
##c5ccccc5C4
Cc1occc1C
c2cnn3cccnc23
CNc1nccc
Cc1cccn2c
C3OC
Nc2ncnc3ccc
CSc3nc
N3CCC3
OC2OC
c2cc3ccccc3s2
OCC1c2ccccc2
Nc4nc
ccn23
c3cc4
c1CO
NCCCN1CCCC1
OC3CCCC3
##c2nc3ccccc3c
ncnc2n1
##scn3
##c2c1c
c2c1ccc1
OCc5cccc
c2ccccc2c1C
c4ccc5ccccc5c4
CN2C1
OC2CC
C1CCCC2
##nc2cccc
ccc1CNC
c1cc2cccc
n3cncn3
nc4ccc
##on2
OCCc2ccccc2
N1CSC
Nc1ncnc2c1nc
c1nc2ccccc2c
##c1ncnc2c1ncn2
##c1ccc2ccccc2c1
CN4C
CCCCc1nn
Nc2cccc3
CCC2CCCCC2
c2oc3ccc
OCc3ccc4ccccc4n3
ncnc2s1
##5CCC
c2N1
Cc1o
N3CCOC
c1cnc2cc
ccc4o3
c2cccnc2Oc2ccc
Cc2nc3c
COc1ccc2ncc
Fc1ccc2
Nc2ncccn2
n2C1
ccc2nc1
C1COC2
OCCN2CCCCC2
2CCCN2C1
cc2CC1
Cc4ccc5c
CNc2c
n2ncc3cc
CCN1S
sc2c1CCN
##3ncnc
CCc1ccccn1
c2nc3n
2c2cccc
##5CCN
n2c3c
Cn1c2ccc
##SCc1ccc
C1NC2
c2ccccc2n
7OC
NCc5ccc
c2ccccc2NC1
##3C4
Nc1ccccc1O
##4ccccc43
ccc1Nc1nc
c2S
COCCCOc1cc
CCCCCCCO
nc2scc
Cc2cnn
N5CC
##CCCCNCCCCN
##sc4ccccc34
Sc2cccc
##n6
##N3C
##6O
##c1cccs1
c2cccn2
c3ccccc3NC
ccc1c23
##CC3CC3
ccc3s2
NCC3CC3
CCc4ccccc43
CCC1CCN
CNCc1cc
2O5
##CN1CC
##n1cncn1
CCn1ccnc1
C8
PH
Sc1cc
Nc2cnn
N1Cc2c
C1CCc2ccc
Nc1nonc1
##c2cnccc
##CCC1C
CCCC1C
##nc45
c2nsc3ccccc23
NCCCc2ccccc2
Oc4cnc
CCCc2c
COC4
nn1CC
##3ccccc3c1
Nc3ccccc3S
c2ccncc2NC
##c1cncnc1
c2cc1OCC
1c1nc
COc2ccccc2C
cc2cnc
c4ccccc4n3
CCCCCCS
CCCCCCCCOC
Oc2cccc3
CSc1nn
c2ccccc2oc1
CCn1cnc2c
2S1
N1CCCCC1C
CC1Cc2ccccc2
##sc3n2
1CSSC
14C
##SCCNC
CCn2cc
##CCNCC3
NC2CCCN
1CN2CCC1CC2
ccc4Cl
c1cc2c3c
##Oc2ccccc21
CCc3nc
N2CCCC3
COCc3ccccc3
N1CCN2C
NCCN1CCCCC1
c7ccccc7
c2cc1NC
n1nnnc1C
c4cc5c
csc2
oc3ccc
cc3N
N2S
CC21
NCCc3c
CCCCNS
##ncccc23
Nc3ncnc
##c2ncccn2
Nc5
COCC2
1C21
nc31
c1Oc1ccc
OCCCOC
no4
Cn1ccc2cc
1Cc2ccccc2CN1
1C21CC1
##OCCN
##oc4ccccc4
ccc2nc
##nnc1
Nc2ccc3ccccc3c2
CCCCN1CCN
CC1CCCCN1C
nnc2C
cc1C21N
c2csnn2
c1I
c2ccnc3ccccc23
COc1ccccc1NS
NCCCN2
N3CCc4ccccc43
OOC1
##cc3
CCc3cccc
##CCCN1CCOCC1
c3ccccc3N2
CSc2ncc
nc3c2c
NCCN2C
ccc4c23
1NS
c1cncnc1
C6CC6
2c3ccccc3C
##OS
##oc3ccccc3
CO5
##CCCCCCC
CCCCN1CC
OCCOc2ccc
c5ccncc5
cn4C
Cn1nccc1
2CC3
##5CC
##Sc3ccc
NCN
c4ncccc34
C32
CSc3ccc
NCCS1
OCCN2CCCC2
OCCCc2c
CC1CCCCN1
COCCOc1ccc
##ncc12
CCCCc1ccccc1
##nccc3
Nc2cc3
NCCCCCCC
CCN3CCCC3
c2ncccc21
cncc3
n4cn
c5ccccc54
CCn1c2c
##c1c2ccccc2nc2ccccc12
2c2cc
2SC
31C
n6
COc4ccccc4
##CCCN2
cc1OCc1ccccc1
1CN2C
Nc2ncn
c3cnn4
CSc1nc2ccccc2c
CC1C2
Cc2noc
Cn1cnnc1
CN1C2CCC1CC
CSc2n
##c2ccnc
##2C3CC
c6c5
c2ccc3ncsc3c2
##c2ncccc21
1N1CCCC1
c4ncccc4
N1c2ccccc2C
CC2c2ccc
CCCCCCCCOc1ccc
c5cn
##n1Cc1cccc
c5ccco5
c2cccc3nsnc23
n2ccc3c
cnc34
54C
c5nc6
2CCCNC2
COCCN1CCN
n2nccc2
nc4c
##c3c4ccccc4
NCc2nnc
c4n
ncn2C
##nc3nc
cc4o3
cccc31
CCCCCCN1C
2CCCO
CCc2ccccc21
c2CC1
##n3cccc
CCCNCC
N2Cc2ccccc2
NCCOc2ccccc2
NC4CCN
CCOc1ccccc1N1CCN
ON1C
##n1c2c
n1CCC
##ncc2C1
Nc1nn
cccc3c2
Nc2cnc
OCc2csc
CCCc1nc2c
##n2cccc
##n2cncc
##c4c5c
OCCCCCN
NC1CCCC
##ncccc2C
##c6ccc
NCc4ccco4
CSc1nnnn1
##c1nc2cccc
COC1CCN
CN1c1ccc
##ccccc56
n2Cc1ccc
Clc1ccc2
c7ccc
3c4
##c3ncccc3
Nc1nccn2c
c2c3ccccc3
c3CC
n2c1n
##nccs4
##n3n2
NCC1CC
c3cc12
c3cnc4
CN1S
cccc2OC
##CCO4
nc1OC
Cc3ccc4
NC3CCOCC3
c6c
Cc1ccc2cccc
CN2CCc3c
c1cc2n
1CCCO
##5CCCC5
CCN2CCCC2
Nc2ncccc2
Cc2ccccc2OC
C2CO
cc2n1Cc1ccc
##C1CCCN
CCCCN2C
NCCN2CCN
N3CCc4c
n2ccc3cc
c1cccn1
CC1CC2
CC12C
##n21
NCCCCCNC
Cn1n
Nc1ccccc12
OC1CC
##CCCCCCCCCC
NCc3ccccc3Cl
10c
C4CCNCC4
1c1c
cnc2cc
COCCCC
##OCO4
cc3c2c1
CC2CCC1
##3ccccc32
c1sccc1C
##cc1O
NCCCN3CCN
c1ncccc1
C1Nc2c
c1cc2cnc
c3cnccc
Nc1nncs1
56
c3ccccc3n2C
2CNCCO2
nn3c
c1cccnc1Oc1ccc
cc2n1CC
3C1
oc2ccccc21
1Cc4ccc
##c3ccccc3c3ccccc32
Oc1ccc2cc
NCCCN2CCC
c2cncnc21
cc1Nc1ncc
##ncc4cc
NCc4ccc5c
cs4
C12CCC
ccnc12
CC3CCOCC3
2Oc3c
ccc3ccccc32
CCC1CCCCC1
COCCCn1c
1Cc2ccccc2CN1C
N2CCSCC2
8C
CCCCc2nnc
c3cc4ccc
##oc5
CNCc3ccc
CCOCC4
##c4ccc5c
NCc1ccccc1F
Cc1cnc2nc
c1ccccc1Nc1nc
Oc2ncccc2
c4nccs4
##ncc1Cl
##SS
cc3n
Cc1ccc2ccc
CCOCCC
N1CCCc2cc
NNc1ccc
Cc1ccccc1CNC
c3no
CSc2nc3c
c2n1Cc1ccc
3c3cc
##1OCC
c1sc2
##ccccc8
OC6
CNc3nc
CCCCCCC1
OCCc2ccc
1CCCCN
oc2c3c
CCN1CCc2c
##H3
##c1oc
##c1ccccc1O
C3CCCC
Nc1cccc2c1C
c2ccc3oc
NC3CC
nc2ccccn12
sc2ccc
c3oc2
##c3ccccc3OC
1CCCCN1
c1cnccc
c1ccno1
N3CC4CCC
c2ccccc2N1C
Cc1ncsc1
c1nn2c
cc2c1NC
##n3cnc4c
##5CC6CC
on4
##snc1
Cc1ccccc1CN
ccc4OC
##nc4ccccc43
Cc3nnc
CN2CCc3ccccc3C2
##5I
CC1NC
COCc2ccc
OCCSC
cn2c1N
CCCc1nn
##n2nn
cc5F
Nc3cccc4ccccc34
cc2cc1
c1cnn2cccnc12
CCCNC1
CCCN2CCOCC2
125I
c1O2
NCCCCCCCCN
Nn2c
##oc3c2
c3ccccc3c1
CCOCCOC
ccc2S1
cc4O
nc3N
CCS3
##CCOC4
c1sc2ccccc2c1Cl
3CCNC3
##cc2ccccc12
Cc1oc2c
##c2ccccc2F
Oc2ccc3ccccc3c2
c1nonc1
csc1NC
OCCC3
##oc2C
##c1nnn
CCCc3ccc
##CN3
CN1N
NC2CCS
CN1C2
##c5c4
n4nc
n2Cc1ccccc1
c2nccnc2C
n5cc
c4cnccn4
##4CCC3CC4
CCCc1nnc
CC1CCC2
N2c2cc
COc1cc2ccc
CCCCc1ncc
nc3nc
Oc1ccccc1N1CCN
OC3OC
COC1CCC2
c4ncnc
sc3ccccc23
Nc4nccc
c1ccccc1Sc1ccc2c
35OO4
NCc3ccncc3
OCc5ccc
C2CC3CCC
##cnnc3
cnc3ccc
OC1O
CCCCCCCCCCCCCCCCN
c4ccc5nc
oc4cc
C1c1cc
C2CCCCCC2
n2n
OCC3CCCCC3
Nc1cnn
ncc4
nn5
noc2
COCCNc1nc
##n1cccn1
n1cccn1
1cn
3c2
4ccc
##2ncc
c2c1nc
##ccccc35
cc3CCN2C
c3ccccc3n
##c1coc
c3cn2
N2CCNC
##c2noc
5CO
c1ccnc2ccc
CSc2nn
COCCN1CCC
##c1csc
COc1ccccc1OC
c2nc3ccccc3nc2
Cc1cncn1
##n3Cc3ccc
CCc1c2c
n4ccnc4
sc4c3
Oc2ccccc2C
oc3ccccc32
##CCc2ccccc21
c2NC
##OC5
CCCSC
C3CCCO3
NCCc4ccc
##nc3n2
CCCCN2CCN
NCCN1CCC
##c2ncn
cc2c1Nc1ccc
sc23
CCOc1ccccc1N
Cc1cc2oc
ncnc2cc1OC
FC1
##sc3ccccc3
CCc2nc
c4sccc4
NCCc4ccccc4
1OCc1ccccc1
##cccc1c23
CSc2nc3cc
c3nnnn3
oc3c
##CCc2ccccc2
##c2oc
CN2CCS
Cn2cncc
32OO4
c1c2ccccc2c
##n2cccn2
OCCCOc2ccc
c1c23
##CCNC2
CCCc1n
##CCCN3
cc4n3
cccc1OC
CCSc1ccc
ccc1C2
OCCN2
Oc2cc3c
cncc2Cl
Cc2cc3ccccc3nc2
CCn3c
cc3oc2
##CCOc2ccccc2
##CCCCCO
c2c1CCC2
c1nnc2n1
c3cccnc3N
N5CCNCC5
##13
CCc2nnc
C3NC
CN2CCO
Nc1cccc2cccnc12
##c1nccs1
CSCc1ccccc1
C3C4C
c2occc
CCN2CC1CC1
Nc3nc4ccccc4s3
##5cccc
CNc1c
##CCCCO2
C1OC2
CCCn2c
##nn4C
C1COC
Cn2nnc3ccccc32
NCCc1nc
Oc2cccnc2
CN1CCc2nc
Cn1ccc2c
##oc3ccccc3c2
CC1SC
n1cnc3c
n1nnnc1
CCCCc2ccccc2
CNC2CCN
ccc2n1Cc1ccc
nc3sc4c
c1OCc1ccccc1
cccc1C2
sc2N
Nc3ncnc4
OC3C
C1SC
CCN4C
Cc3ccc4ccccc4c3
Nc3cnn
##sccc12
cccc1N
c2nnnn2C
c2cc3cccc
Cc1nc2nc
Cn2cccn2
c9
ns1
sc3ccccc32
##Oc4ccccc4
cc1C1CCN
c2ccccc2O1
NCC1CN
c1cccnc1Cl
c2ccncn2
Oc4cnc5
1CCCO1
NCc2cnc
##CCOc1ccccc1
c3ccccc3c21
2C2
nc3sc
OCCN2CCN
##ncccc3C
cn3n2
CSCc1ccc
2CCNC2
3n2
##sc2ccccc2c1
OC1CN
OC2CN
##CCCCO1
n1O
##c1cccc2
NCCS2
c3c2OC
ncc1Br
Cc1nc2ccccc2n1
##2C3CCC4
Cn1c2ccccc2c2ccccc21
##CCCNCCCN
n1nnc
##c2cccc3ccccc23
3O2
CN1Cc2cc
NCCCCc1ccccc1
CCCCCCCCn1cc
noc4C
c1ccccc21
##CCNCC
c2ccccc2n1C
C3CCCCCC3
CN2CCOC
c1OCc1ccc
##2ccccc2c1C
CCCCCC3
1CCCNC1
c1nc2n
P1
NCCc1ccccn1
OCC4
CCCN3CCOCC3
3CS
CCCCN1
Nc1ncnc2c
OCCOCC
cc1Nc1nccc
##CCCCN1CCN
##6ccc
##cn3
N2Cc1ccc
N2CCc3ncnc
OCCN4CCOCC4
cc2C1C
Nc3ccccc3OC
c2ccncc2F
OCC2CCCCC2
c2ccc3ncn
ncnc2cc1OCCCN
Nn3c
OCc3ccccn3
CCN4CCCC4
cc4cc
NNc1nc
##2CCC3
cc2cc1C
oc3c2C
ccc1Nc1ncc2c
##c2ncccc2C
1nc1ccccc1c2
##3ncc
c2ccccc2OCC
CSc1ccccc1C
OCCn2c
CCOC2
c2ncnc3c2
nc3C2
N2Cc3c
CCSSC
##3ccccc3cc
##CCCCN3
C2CCCNC2
Nc3nc4c
Cn4cnc
9O
##3CCC2CC3
C2CCC3
ccnc21
CC2CCCN
##CC2CCCCC2
CNCc2c
3C3
COCCn1cc
OCCCCCCC
c6cccc
##cnccc4
3oc2c1
Nc4ccccc43
Nc2ncc3
c2c1CCC
c1Cc1ccccc1
C2COc3ccccc3O2
cn5C
1CCCN1CC
OC2O
##CN1CCC2
##O5
##1c2
##Sc3ccccc32
NCc1nnc
CN5C
N1c1cc
c1ccccc1CC2
C3CCS
##C1OC
N1CCC3
Nc1cccc2c
c2cnc3ccccc3c2
2CCCN3CCC
c1cscn1
##CCN2S
COc1ncccc1C
Cc3nccs3
##Sc1nc
OCc4c
c2ccccc2o1
2CSC
OCC5
c3cc5c
Nc2cccc3c2
c1ccc2sc
Cc4cccnc4
c1ccccc1CO
C2CCCN2
c5ccoc5
Nc3ncc4c5cc
c1c2c3c
NCc4cc
NCN2
CNc2ccccc2
cc2CN
ccn3C
##n2cnc3c
c1ccccc1N1CCN
c3ccccc3nc12
##c2ccsc2
CCCNc1ccc
Cc1csc2nc
c1nc3ccccc3
cn3c
CCN3CCCCC3
COc1cccc2c1CC
c1sccc1
4CCN
cncc1Cl
c2c3
C23C
Cc1cc2ccc
Cc1ccoc1C
nc1Cl
nc3s2
CN1CN
Cc2coc
NCCCCCCCN
C1NN
##Oc1ccc2c
CCc1sc
c1sc2c
cc3Br
CCCCCCCOc1ccc
ccc3nc
2CCOC2
Oc2ccc3nc
sc2c1CCC2
##c6cc
cn4C3CC3
n1ncc2c
##cnccc34
SCC3
cc1n2
CCN4CCOCC4
3CO2
nc3ncn
c2cccnc2N
Oc2ccnc3
c2c1CS
##CCC4CC5
OC4CCN
Cn2cnc3
cc3c12
n2ncc3
CNCc1ccccc1
CCCNC2
Cn1cccc1
nc1CCOc1ccc
ccc3n
CN1c2ccc
NCCNS
c3c2N
ncc21
nn34
2N2C
ccc54
n1CCc1ccccc1
Oc1ccc2c3c1O
Cc1sc2ncnc
n2c1COCC2
c31
##CCNCCCN
C2SC1
##n2c1n
CNCc1cccc
CCOc1ncccc1C
##nc3N
n2ncnc2n1
N3Cc4ccccc4C3
c1cc2ccccc2c
c3cccnc23
2Oc3cc
Cc2ccccc2C1
NCCN4
N1CCSCC1
c5ccc2
Nc4ccc5
##sccc2C
11c
cnc3c
NCc2nc
c3sccc
cc2CC1C
CCNCc1ccc
CCCCCCCCCCCCO
ccc1C1
CCN1Cc1ccc
21O
OCCCCCCN
##c4ccccn4
CCn1c2ccccc2
c3cccc4cccc
CNc2ncnc3
NC1C2CC3CC
CSc2nnnn2
CCNc1ncc
1COCC
ccc2NC1
CCCN1CCOCC1
ccc1N1CCCC1
CCCCN1CCC
C2COC
c3c2CN
CCN1CC2
CCCO2
NCCCCO
CCCCCCCCCCCCCCCCCCCCC
c2nc3ccccc3n2C
cccc43
c1cccc2cnccc12
N1c2ccccc2Sc2ccccc21
c2nccnc2C2CN
Oc1nc2cc
NCP
c2c1c1ccccc1
CN1c2ccccc2
NCCNCCO
CCC1CC2
Cc4ccccc4F
CC1CO
c1ncnc2c1ncn2
11CH3
2c3
CCc2ccccn2
##c2c3ccccc3
COCCN1
COCO
##ncc21
C1NCN
##nc5c4
c1nccn1
Cc3nc4ccccc4
c2sccc2C
1c3cc
##4n3
C2c3
N2NC
CC2CCC2
ccc2OCC
ccc3c1
CC4CCCCC4
c1nsc
1CCCN1C2
c2sccc2n1
C1C2C3C
2c1ccccc1
As
Sc2ccccc21
sc3cc
sc2ccccc21
sc2ncnc
c2ccccc32
##CCC5
cc2ncn
c4oc3
cc3n2C
##CCCN1CCC
c3ccccc3c12
CNC4
##nc3C
c4ccccc4O
SCc2c
OCCN4CCCCC4
CCc1ccccc1N
1ccc2c
c2onc
C13
##c2ccc3
c4OC
c2ccccc2CN
c3ccccc3c2C
c1cccc2nc
CCCCCCCCCCCCNC
c1Oc1cc
Nc3ccnc4cc
NCCOc1ccc
OCc2cccnc2
1n1ccc
ccn2C
##c2cccs2
N2CCCCC2C
N4CC5
CCS1
NCCCCCCCCCCCC
nn1Cc1cc
Cn3cccn3
N3CCSCC3
OCCCO3
CNCc2ccccc2
CCOS
1OS
nc2n1Cc1ccc
ccc3oc2
##4cnc5
N2Cc3ccccc3
ncn3C
CCN1c1ccc
CCCCCCn1c
23OC
OCCCN2CCN
N1CC2CN
oc1ccccc12
##Sc2ccccc2
##CCOc2cc
COCc1c
CC3SC
NCCN2CCCC2
NCCCc1c
ncnc3cc
NCC1CCCN
n5cnc
COc1ncccc1
cnn4C
##cnnn5
cncc3Cl
##2nnc
##snc
c2cccn2C
CCN4
c2ccn3c
CSc2cc
Cn1ncc2
NNc1ccccc1
Cc1ncnc
CCN1CC1CC1
2CN3CCN
n1ccc2cc
##7ccccc7
c2CN
2Oc3ccc
##nc4n
23CCN
Nc3n
COc1ccc2sc
c2oc3ccccc3
c3nc4ccccc4n3C
CSc1sc
1c2ccccc2c
n1cnnc1
1CCCCC
Cc6ccccc6
c1CN1C
C2c3ccccc3C
Cn2cnc
cn2c1C
NC3CCC3
N2CCc3ccc
ccc2c1Cl
cnc2nc
ccn12
n2Cc2ccco2
##1Oc1ccc
c1cccn
##CCCCC2C1
NCCc1cc
##ncccn2
Cc2nnn
C6C
##occc3
n5cnnn5
sc1NC
Nc3ncccn3
13CCN
2nc
csc12
nnc2c1
c4oc
##c3ccccc3C1
NC2CCOCC2
Cc1nsc
CCCOc3ccc
n4cccc
CCCCCCCCCCNC
CCc2ccc3c
n2nnnc2SCC
COCCOCCO
OCc2ccccn2
CCCc1cn
ccc2N2CCOCC2
cn1c23
3OCC
C1CCOC1
N3CCCc4ccccc43
3CO4
C1C2CCC
c3cnc4ccccc4c3
c1nonc1N
##n3c2C
##c3ccccn23
CCCOc1c
CN3CCC4
c2nnc3sc
CCCCCCCCCCCCCCCCCCNC
Cc4ccccn4
##n1cnnc1
c2sc3ccccc3c2Cl
##CCCCNC
cc2c2nc
##2C3C
cccc2c
c2ccc3c4c
c1ccc2ncccc2c1
c3cccc4cccnc34
Nc3ncn
CSc1ccccc1NC
Nc5cccc
c3nc2
Cc1c2cc
C21CCC1
c1ccccc1O2
1Cc1c
c3ccccc3o2
CCCNc1cc
nc1S
ccc3c2C
##c2ncn3C
Oc1ccc2ccccc2c1
c3cnc4c
Cc3nnn
Cc4ccncc4
N6CCN
N4CCCCCC4
##c3ncccn3
cc2ccccc12
NCCCN3
n4n3
c4cccc5ccccc45
Nc3nc4ccc
CC1CCCCC1NC
##CCOCCOCCOCCOCCOCCOCCOCCO
31CCN
c1N1C
N1CN
N2c2ccccc2
c3ccccc3oc2
N32
cc4c32
Nc1ccnn1
n1C1CC1
COCCn1
C2CCCCN2C
3OC1CC
c4cncnc4
c2I
##CCCC6
N1c1ccnc
CSc1ccc2c
##c1no
ccc1O2
nn32
CCCCOc1cccc
NCc1coc
c2c1CCc1ccc
c3cnn4cccnc34
cc1N1C
c3n2C
##CCCCCC4
##1C1
OCCc1ccc
c2c1CCN
n3CC
ccc1OCCN1C
##CCNC4
C5CCCCC5
##N1CCNCC1
CC1CCc2c
COc1cc2ncc
n2cnc3ccccc32
NCCCNCCCCNCCCN
##snc2
c2C3
##CCN2C1
Nc2onc
NC1N
cccc1O
c3ncccc3C
c2csc3ncnc
Nc1ncns1
oc2ccccc2c1
NCc3cn
Clc1ccccc1C
##c2ccco2
##n2C1
CC23CC4CC
NCCc2ccccn2
SCc3cccc
NCCC1CCN
c4cc3
CN3CCCN
2c3cccc4
cs
coc2cc
##oc23
1C2CC3CC
Nc2ncc3cc
OCCN1C
##nc2c1CCN
Nc3ncns3
Sc3cc
CCc3ccccn3
COc2ccccc21
OCc1cnc
CNc1ccccc1
CCCn2ccnc2
##c1ccsc1
CCCCl
NCC4CC4
CCC1CCCC1
NCCCN2CCCC2
c4cc3ccc
##n3cnc4
OCCCN2CCC
N2CCCCS2
cc3c2N
c3nc4ccccc4o3
nnc2SCC
Cc4cn
CCN1CCCC1CNC
##c4ccncc4C3
Cn4ccnc4
1C2CC3CC1C
Cn5
c2ncc3
CCCP
##CCOc2ccc
c3ccccc3C1
ccc2ccc
c3ccnc4
cc42
n3nccc3
c1C3
##c1nnc2n1
##ncc23
##N1S
##C3CCCCC3
nc2c1nn
##ncccc3o2
##nncc2CO
cccn2c1N
6CCCN
Fc1ccccc1C
C2c1ccccc1
Cc1ccoc1
##n3CC
##C2CCOCC2
##c4cccnc4
##n1cnc
NO3
##sccc2
c2cscn2
c1ncc2c
34CC
c1ccccc1Nc1ccc2c
3CCCNC3
Cn4cncn4
2c3ccccc3
cc2c3c
##CC12
c1Cn1cc
CCCCN3CCN
CN2CCNC
CN2CCCCCC2
COc1ccccc1S
1CNCC
##n4n3
Nc1ncc2c
COc3ccc4c
Oc3cc2cc
c1oc2c
c2nonc12
##n4ccnc4
cc2c1OCO2
3cccc
Oc4c
Sc2nnc
##c2ncccc2
NCc1cnc
C2CCC1
c4c3cc
COCc1cccc
c4c3C
ncc1F
NCCOCCOCCNS
COc1cccc2c1CCC
c3oc4ccccc4
ncnc1N1CCC
CC1Cc2ccccc2N1C
##c3nn
CC2CCOCC2
n1n
c3ccccc3c
Cn1cccc
c1cnc2ccccc2n1
CCCNC3
4C5
ccc4O
COCC1CN
c2nccn2C
3CNCCO3
nc2n1C1CCCC1
c1nccc2cc
CCC1CCCCN1C
COc2nc
##CCN12
NCC12CC3CC
Cn1nnc2ccccc21
##n2cncn2
N3Cc4ccncc4C3
c2cc3n
13CCCC
c3cc4ccccc4s3
##Oc4ccccc4O3
3CC4
##3nnc
##c31
SCc1ccccc1
C1CCCCN1C
CCc1ccc2
CCC3C2
##CCCCN2C
##oc3ccccc23
nc3cccnc32
c2noc3cc
CCCn2nncc2CO
14c
##CCc3ccccc32
##c3cncc
cc2CN1
Cc1nnn
##n1nnc
cc1OC2
SCc1ccc
c4cc5ccc
ccc4ccccc34
##c2no
ccc5c34
c2snc
Cc1cc2cc3c
cc3CN
NCC1CCC
cccc4C
NC1CC2
NCCCNCCCN
NCCCN3CCCC3
1COP
CCCCOc1c
C3CCCN3
1c2ccc
Sc4ccc
COc4cccc
cc2CC
Cc1c2
c2ccccc2C2
c1COC
SC2C
COc1ccccc1Cl
C2Cc3ccccc3C2
Nc2ccn
c3c2CCC3
CCc1nc2cc
COCCO1
43O
c1sccc1NC
CSc1ncccc1C
C1c2cccc3cccc
Cc3cncn3C
c4cc3ccc4O
3CCCO3
NCCCCC2
##c1CN
c1C1CC
ClC
CC1CCO
c4c2
CC21C
NCCCn3ccnc3
nc2c1CN
1NCC
OCC2CCN
c2nc3nc
ccc2c1COC2
nsc1
##nn12
c2CC
COc1nc2ccc
cc2cn
n1CC1CCCO1
Nc1ccc2ccc
ccc2n
C1CNC
ccc4ccccc43
cccc4c3
n4cccn4
3CCCN4CCC
Nc2nc3ccccc3nc2
##ncc5n
Nc3ncc4c5ccncc5n
##nc2c1C
CN1c2ccccc2C
c3noc4cc
c2cc3ccccc3cc2
##cnccc2
n5ccc
COc1nn
Nc1ncccn1
##c3nc4ccccc4s3
SCCNC
##sn1
c2c3ccc
c2c3cc
CCC3C
CC2c2ccccc2
CC2CCCN2C
C3CC4CC
##NCc1ccc
CCCCc1nnc
##2CNC
c3ccnc4cc
CN2CC3
Nc1ccccc1N
N1CCSC1
CCC1N
c3c2O
c1cc2ccccc2cc1O
##c2nccs2
C2Nc3ccccc3C
c3nnn4cnc5
c3cnc4ccccc4n3
COCCN1CC
CSc3nnn
CCCCc1nc2cc
Cc3ccccc3C2
c2nc3ccccc3nc21
cc2cn1
Nc2c3ccccc3nc3cc
N1Cc2ccccc2CC1C
Oc2cccc3c2C
OC12
C1Br
cccn12
##c4nnc
c1ccn2c
c1cc3ccccc3
NCCNc1ccc
12COC
##c6c
CSc2ncnc3
Cc5cccc
Oc3ccccc32
##c1nnnn1
cc8
NCC3CCN
CCCN3CCN
NCCN3CCCC3
cc1COc1ccc
Cc3ccccc3OC
Oc1ccc2nc
NC3CCCCCC3
Cc1no
CNCCc2ccc
c2cc3ccccc3nc2
CN3CCNCC3
oc2c1ccc1
Nc2ncns2
CC32
##nc1Cl
Cc1cn2cc
##C2O
1CCOC
c1Oc1nc
Cc1ncccc1
##ncccc5c4
c3cccnc32
Cc4ccco4
n2ccnc2C
##3cccc4ccc
NC2CCCc3ccccc32
c2oc3ccccc3c2n1
cnc4c3
COCP
c2csc3ccccc23
ccc1Oc1cc
OCCO1
c1ccc2nc3ccc
c2cccc3c2C
sc3n
##nc3c2O
NCc4cccnc4
oc4ccccc34
N1Cc2ccncc2C1
noc4c3
c2sc3
CCC2C1
cc3nc
cc3oc
##CCCN1CCCCC1
##n3c2nc
N3CCO
CCOc3ccccc3
ccc24
CCCN2CC
1Oc1ccc
Cc2ccc3
NC1CC2CCC
NN1CCOCC1
Nc1ccccc1N1CCOCC1
cccc24
nc4C
CCn1nc2c3c
sc2c1CCCCC2
ccc1Nc1c2ccccc2
NOC3
##c2cncnc2
c2cnccc2
##Oc3ccccc32
##Nc2ccc
##3n
C1c1ccccc1Cl
C2CCCC
C2S1
CCCF
cccn2c1C
cc3ccc
cc3nc2c1
C3c4ccccc4
##CC2CCCO2
c2CO
OCCN1CCC
2OC3
Oc2ccnc
nc2ccsc12
##23CC4CC
c2sc3c
CCOCC1CN
cc3CCc3cccnc32
3F
c1N1CCN
c3c4ccccc4
CCCc1
c4ccccc24
1Cn2c
CCOCCN
CC3CCC
Cn1c2ccccc2c2cc
NS2
CN1CCOC
c2nsc
2CCc3cc
NCCCCCCCCCC
##CCCNC4
C2CCNC2
Oc1cccc2c1
##CCSSCCN
c2nc3cnc
nccc2c1
##4n
##Nc1ccccc1
##c2nc3
OCCc1ccccc1
Nc1scc
Nc2ccccc2S
OCCCc1c
c2ccccc2CO
##CCCCN2
Nc1ncnc2c1ncn2C
c1ccc2ncsc2c1
Nc4ccccc4C
ncc3Cl
Nc3ccncn3
6CCCN6C
OO3
##3CCCC
##SS1
NCc2ccccc2C
OCN
C1CCCCCC1
Cc1c2ccccc2
##cnc2C
n1CCOC
C3CCOC3
N3CCNC
OCC3C
nc1CC
ccc3ccc
NC1c1ccccc1
c4ccccc42
NN2CCCCC2
c3cccnc3c2
##nc5ccccc45
NCCO2
C3COC
C1CCCN1S
cnc1Cl
ncn2CC
c2nc3ncccc3o2
nc5c4
nc5ccccc35
c3cc4ccccc4oc3
12c
3n
5CCC
Cc7
##2CC3
c1c3c
##CCC1C2
##CCN2CC
CC2N
COCc1nc
c2cnc3ccccc3n2
nn2CC
C2Cc3cc
##CCN1c1ccc
CC1CNC
N3CCCC3C
Nc4nccs4
CN5CCOCC5
cc2ncnc
2CSSC
56C
nc4ccccc4c3
##2sc
c2c2cc
c2C2CCN
C1c2
##cnc2
CCCCn1nc
NCC1O
nc2ncn
cc1Oc1ccc
Nc4cccnc4
c5ccccc5F
Cc3cccc4c
ccc2n1CC
Cc2nc3ccc
cc1CN1CCN
c1ccsc1NC
SCCCC
cc1c
CC1CCOCC1
NNc2ccc
CCc1ccc2nc
OCCNS
2CCCN2S
c3cn4c
c4c3CCCC4
ccc56
##nonc23
##1c2c34
oc2nc
NC4C
cc2oc3cc
##CCCCOc1ccc
cc3C1
CCCCCCCCN1C
COc1cc2ccccc2
NC2N
ncnc2c
c2ccc3ncccc3c2
CCCCCCc1ccccc1
##sccc21
NCCOc1ccc2c
1COc2c
OCc2ccc3ccccc3c2
c1Nc1ccc
Cc1nccs1
CCCCCCCCCCOC
ccc2OCc2ccccc2
CCCCCCCCCCCCCCOc1ccc
c2ccnn2C
c2cc1F
ncnc2cc1OCC
OCCOCCOCC
cnc43
sn1
##7CC
c3c1O
##cccc1O
##cnc3
c3ccccc3nc2c1
CNC1CCN
Cc2ccc3cc
C4CCC
COc1ccccc1CCNC
Cn2ncc
1CN2c3c
Nc3cc4c
CN2CCNCC2
c2nnn3cnc4
CC1Cc2c
Cc4cccs4
NCC2C
c3ccncn3
##CN1CCCC
##n3cccn3
3c4cc
oc3ccccc3c2
##5CCCCC5
##2c3cc
##CCc1ccc
c1C1CC1
c3CC2
CCNc2cc
CC2CCO
CSc3ccccc3
CSCCNC
CCCCC1CC
CCOCCCN
OCC1CCN
NC1c1cccc
NC1CCC1
cn2n1
N2CCCc3cc
CCC1CCC
N2CCc3nc
c2cccnc2c1O
OCCCN2CCCCC2
##CCCCCCCCCCCC
##n2c1CN
##oc4ccccc34
c4nc5ccccc5s4
nc2sccn12
13c
8OC
##H2
C2c3cccc4
cc3S
CCCCc1nc2ccc
NCC3CCCCC3
##nnc4ccccc43
##c2cccc3cccc
Cc1ncsc1C
##ncc2ccc
CCC31
CCCCCCCCCN
##CCCCNCCCN
##CCC12C
c2ccccc2c1O
C1C2CC
CCOc1ccccc1CNC
c3sc4ccccc4
n4cnnc4
c3c1C
CCCNc2ccnc3cc
CC3CC
cc4ccc
Nc2c3c
n3cnnc3
ccc3OCC
123
##N1CCC2
##ncccc4C
##c2cnn3C
##n3c2NC
Oc2ncnc3
Cn2cnc3ccccc32
5CN
nnc21
##Oc2cc
c3c2cc
COCc2cc
OCCc3ccc
c3cccc1
CCCCOP
34CCC
##nn2C1
##5cccnc45
3cc2c1
##c8c
C1Cl
##nc2nc
##CC2CC
OCCc3nc
c3cc21
CCSc1n
OC1OC
CCc1ccccc1C
C1c1cccnc1
ncc2F
##54
##3ccccc13
##CCN2CCOCC2
##n2n1
N2c3ccc
c3ccccc34
NCCF
N1Cc2ccc
NC34CC5CC
cc5N
2CN3CCC
COc1ccc2c3c1
##sccc1C
Nc1ncnc2c1
2cc1
N6CCOCC6
2CCCO2
35C
oc4ccc
c3O2
##CCNCC2
c2c1c1
c3cscn3
##c4cccnc43
c2cn3nc
ccc42
c2nc3ccccc3nc12
Oc1ccccc1Cl
OC3CCCCC3
c2cc3c4c
Cc4cnc
nccc12
SCC1
c1n2C
COn1c
CNc2ncc
cc2S1
Cc1ccc3c
##c3ccccc31
c1csc2ccccc12
nc2c1ncn2C
c4ccc5ccccc5n4
NC1c2ccccc2C
C1Cc2ccc
3CCOC3
##ncccn5
Cc2ccoc2
c3nsc4ccccc34
NCCSSCCNC
Oc2cncc
CC3C5
NCC4CCCO4
CC2CCC1N2C
1c2cc3c
c4c5
1C2CC
c2coc3ccccc3c2
nc1n2
N2C3
SCc2nc
##CCCOc1cccc
ccc1Oc1ccccc1
c2cccnc2Cl
c1nc2ccccc2nc1
Cn1cccn1
COc2cccc3
sc3c2CCCC3
c2cnccc21
##c1ccn2ncc
NC1CCCCCCC1
##oc4c
CCn2ccnc2
c4s3
CC2O
1Cc1cccnc1
C34
CCCC2C
nc2c3c
c4ccccc4c23
3CCCCN3C
Cn1ccnc1C
Nc2ncnc3c2
NNC1
COCCS
CCOc1cc2ncnc
oc2cc1O
cc3c2C1
CCCCOc2ccc
c3nnc4n3
13O
##c3cccc4cccc
3cc3cc
c1oc2ccccc2c
2Cc3ccccc3CN2
##oc4ccccc4c3c2
OOC2
##6CCOCC6
##n1n
##CCOCC
C3c4ccc
CCCCC1C
N3c4ccccc4
Nc2sc
12CN
NCCCN4CCOCC4
4COC
Cc1ncccc1C
##n1Cc1cc
##c2nn3c
OCCCS
C2CCCN2S
Cc1ccccc1Cn1c
C1c1ccc2nc
nnc4
##oc2ccccc2c1
c1c2cn
cc1c2
N1NC
c1ccccc1n2C
ccc2n1Cc1ccccc1
Cc1ccccc1C1
##CN3C
Cn2cccc
Oc2ccc3
cccc2o1
4COP
nc3cnc
CCc1nn2c
c3cccc4c3CC
Cn1nccc1C
20
CCCc3ccccc32
CCCn2cc
c3cccn3C
c2ccoc2C
OCCBr
nc3scc
COc1ccccc1N1C
NN3C
Nc2ccccc2Br
##c3ncn
OC1CCC
c2cccnc2n1
c2nnc3ccc
c5ccccc5C
c1ccc2ncnc
##3cccc4ccc1c2c34
3SC2
Fc1cnc
CCc1nc2ccccc2c
OCN1C
##CCCCC6
Nc2nnn
SCc4ccccc4
NCCN3CCCCC3
NCCN2CCCCC2
nccn23
cn34
COc2ccc3nc
Cc4ccccc43
Cc3cc4ccccc4
Cc3ccoc3
##5C4
Nc1ccc2ncc
CCCc1cc2c
Nc2nncs2
Cc5
OC3CCNCC3
C2c2cccc
CCCCCN1
##cnn2C
CCO5
2OS
OCOP
2CCCCN2C
Nc1ccnc2cc
nn21
##ncccc3c
Oc3cccnc3
c5ccccc5Cl
CCCCCCCCCCCCOC
c7cc
cccc2c1N
CCc2ccncc2
CCCN1c2ccccc2
c1cccc3c1
5NC
CNCC1
CC12CCN
##CC2C1
CCCCc2ccc
CCCN1CCCCC1
c3cs
##SCc1ccccc1
CCCCCCCCS
c2ncc3c
c3cnco3
ccc2CNC
c3cccc4cc
n3Cc2ccc
c4cnc5ccccc5c4
NCc1nc2ccccc2
##CCCc1ccccc1
##n1CCN
CSc1nccc
CCCCc3ccc
12c3
NC2CCC2
CCCOCC
OCc2ccccc2C
c3cccnc3F
OCCCl
OCCCN4CCCCC4
COc1ccccc1C1C
c4c3C2
ncc3F
ccnc2O1
##oc2ccccc23
cc3cccnc23
##c45
1Cc1cccc
CCCCCc1c
nc2OC
nc1N1CCC
Cc2ccccc2O
C1Cc2ccccc2C1
Nc1ccccc1S
N1CCc1ccccc1
1CN2
Cc1ncn
C1CCCCN1
CCCO3
ccc4cc
cnn3C
##5c6ccccc6
OCCCCOc2ccc
Nc3cncc
NC4CCOCC4
c1ccccc1CO2
OCCCN3CCN
c5c4C2
c1ccccc1OCc1ccccc1
n2nnc3c
Nc2ccc3oc
CCCN1CCC2
NCCCCCCCCCCC
CSc2nc3ccccc3c
##7cc
CCn2nc
NCc5ccccc5
OCc4cc
CNCCS
OCC3CCN
c1cn2cc
CCOC3
##CN2
12CCC3
SCc4ccc
c1cccnc1N
Clc1ccc2nc
Cc3cc4c
nc3cc2
NCc1ccnc
sc1Cl
OCCCCCO
NCCCNCCCCNCCCNC
n4nccn4
2CCO
##8C
##c1c2ccc
##c1ccc2nc
OCc2cnc
##CCN2CCCC2
##OCc1ccccc1
cc3c3cc
##c1ccoc1
n1nnc2ccccc21
c2cnc3nc
CCN1N
ccc2c1OC
c2nnn3c2nc
Cc1cccnc1NC
c1nc2cc3c
nc2c1ncn2C1O
ncc34
Cc1ccccc1Nc1nc
##c2nnnn2
c2ccc3ncnn3c2
##Oc1c
##6CCC
Clc1nc
##cccc3
C1CCCCC1C
CC1c1cccc
cc3NC
##n2c1nc
n1nc2c
COC1OC
CCON
OCCc2c
CC3OC
n32
ccc3CC
c4ccccc4S
SCc3cc
cc1C3
c1cnn2c1
cc1OS
Cc2ccn
Nc3c2c
c2nc3ccccc3n2
nc2cc1OC
2COc3ccc
c2nc3sc
c2cc3sccc3
##n2ccc3cc
C1c2ccccc2S
ncc1CC2
n3nccc3NC
C1c2cccnc2
CC1S
c4ccc5cc
c5c6ccccc6
CN2CCCCC2C
c2ccc3nccc
CN3CCC2CC3
C5O
Cc2cncc
4CCOC4
Cc4ccccc4Cl
NCc1cccc2ccccc12
COc2ccccc2Cl
315
NC5CC5
OCc3nnc
CCCn1ccc
n2C1CCCCC1
nc2O1
##ncccc21
OC1CC2CCC
Nc1csc
1NCCOc2ccccc2
cccc1S
##CCN1C2
noc2c1
CSc1ncnc2
Nc4ccccn4
Nc1ncnc2c1ncn2C1O
##OCCO4
##n3c2CN
Oc2nc3c
2ccn
c3cccc4c3OCO4
3c4c
42
cc24
##CCCCO3
C1C1
C1c1ccc2c
c1ccccc1CC
c2ccnc3c
##c4nc5ccccc5
##ncc2c
CCCCCCCOC
##c3ccnc
CN1Cc1ccccc1
NCCCc3ccccc3
OCCN3CCN
2CN3CC
OCCCCCCO
Cc1nnsc1C
nc3c2CN
n2ncc3c2
c2C2CC2
COCC3
c3c4ccc
CC1CCOC1
##ncc2C
1Cc1cc
CNC2CCCC2
SCc2cn
nn2c1C
1OC2
cnn23
COc2ccc3ccccc3c2
ccc1Nc1nccc
c1nnc2ccc
c1snc
ccc1Nc1ncc2cc
Nc1nc2nc
c1ncccc1Cl
N7
##OCCC2
##oc2cccc
cc3ccccc32
CCNCCN
CNC2CCCCC2
CCOc2cccc
Cc1ccccc1CC
Cc1cs
cc4c23
2OCCC
CCN1c2ccccc2
OCCN1CCOCC1
Nc3cn
c2cccc3nonc23
1CCCc2ccccc21
OCC2CCCO2
CN2CCc3cc
ccc2Oc2ccc
##5ccccc54
COc1ccccc1Nc1nc
OCCCCN3CCN
c3ncccc32
3ccccc3
B1O
##oc1ccccc12
##S4
##c24
CO6
OCc3
CNCCCCN
##CCCCCCO
c1ccc3ccccc3c1
c2ccc4c
##n2ccccc2
n1c2ccccc2
1C2CCN
Brc1ccccc1
2CN1
ncnn12
OCCOCCOCCO
##C3CCCC3
NCCCCCCO
NCc1ccccc1C
##CCC3CC4
c5ccccc5OC
c3cncs3
Cc3cnn
Cc1cscn1
n2c1CCC2
CN3CCc4ccccc4C3
cccc5n3C
##n2cnnc2
##6OO5
##2c3ccccc3n
1CO2
CCCCc1cn
2C3C
##nnc2ccccc2c1
CCOc1ccc2cc
C2C3CCC
nnn3
Nc3cc4ccc
OCc2ccccc2Cl
CCn1nnc
CCCCCCCCCCOc1ccc
CCc1cccc2c
c2cc3ccccc3cc
Cn1cnc2ccccc2c1
c4nc5ccc
OC1C2CC3CC
cccc5n3
##CC3CCC2C3
COCCOc1cc2ncnc
ncc45
##3O
OCc6ccccc6
CCCc3c
CCCc4ccccc4
##c2ccc3ccccc3c2
##1COC
##c3ccccc3c3c4c
##NC4
NCC4CCOCC4
c2c1NC
1CCc2nc
N2CCN3C
CN2CCCC3
N1CCS
2CN3C
NCCOc1ccccc1
NCc2ccccc2F
c1nccn1C
Cc1nccn1C
##CCCCCCCCCCC
c3nccn3C
c2oc3ccccc3c
n3nccn3
NCCN1Cc1ccc
CN1C2CCC1
n5cnc6c
noc4c3F
Cc1sc2c
CNCc3ccccc3
##nc3s2
cc1OC1CCN
N2Cc3cc
Cn2c3ccc
CN1Cc1ccc
c2ccccc2n1CC
CNc1ncnc2
c1ccncn1
C3CCCNC3
cc3CCc3cc
c1ccc2cccnc2c1
##n3cncn3
Cc5cc
csc3n2
CCc2nn
c2CN1C
COc1nc2c
C2c3cc4c
CCC1C2
c2ccccc2n2c
C3CC4
nc1SCC
c3cnc4ccc
NCCN4CCCC4
c1OCCC
c4cc5cc
OCCNCC
Nc3nn
CN1CCc2ccc
c2cccc3cccc1c23
OCCCN3CCOCC3
CN2CCC1CC2
OC3CC
C1CN2C
c3ccc4ccc
1c3c
coc12
c3c3
c1cccn1C
##c1cc3c
cc4c2cc1OC
Cc1cccc2c1C
c4ccccc4N
3Cc4c
Nc1cc2c3c
Nc3ncc4cc
##c4cccc5
##nc5ccc
Nc1cccnc1Cl
CCN2S
##n2ncnc
Nc1ccnn1C1CCN
14O
cc3n12
COC12
1CCCCNC
OCO6
Nc3ccc4nc
##n4c3
12Cc3cnn
CCC12OC
c2sc3cc
OCc3cccnc3
C5CCNCC5
ncnc3cc2OC
Oc1c2c
##nn23
CCCn1ccnc1
##1CO
CSCCN
1OCCC
CCCCNc1c
c2ccc3occ
OCCOCCN
cnc2O
COc1ccccc1CO
Oc1cccc2c1C
cc2Oc2cc
Cc3noc
Cc1cccc2sc
2c3ccc
Oc3ncc
##7ccc
c1N1CC
C2c1cccc
cc3ccccc23
COC1CCC
##c3ccc4ccccc4c3
c3coc4ccccc34
CN1CCO
SCc2nnc
ncnc2c1
cc5Cl
c5cccs5
##1CCc2c
c1ccccc1COc1cc
##3CCC2C
Cc2cncn2C
Cn1cnc2c1c
c1ccccc1OCc1ccc
CN5CCC
2N1
Cc3c2
##sc3ccccc3c2
c2CCN1C
COCCCN1C
OCc4cn
c3ccccc3oc2c1
c2cscc
##c2ccccn12
CCNCc2ccc
Cn2c3ccccc3
Cn2c3c
1CN2CCC
##N1CCCN
cn6C
nn6
N3Cc3ccccc3
Nc3c4ccccc4
c2ncco2
c3cncn3C
ccc2OCc2ccc
nn1Cc1ccc
cc3Oc3cc
##nonc12
oc34
N3CCCNCC3
##nc2ccccn12
2n2cnc3c
SN
cc2CCN1C
##c4nn
ccc3c12
c4ccn
COc2cccnc2
C3Cc4ccc
OCc2ccc3c
##c2nc3ccccc3n2C
nc2cccnc21
C1C2CCCN2C
##nc3c2CC
n2cccc21
n2nnc3ccccc32
##c1nc2sc3c
##c7cc
##oc3ccccc3c2c1
CCCc2cc
CC12CC
COC1CN
C31
CCCCc1nc2c
##C1CCC
c3cc2C
NN3
ccc1OCCN1CCCC1
c1ccc2cccc
CCCCCCCc1ccc
NCC2CCCN
Cc1ccc2nc3c
Cc1ncc2c
##c2nc3ccccc3o2
CCCOc1ccc2
NCCc1cccs1
c4ncn
Nc4ccccc4N
c1nnnn1C
c2ccc3cccnc3c2O
N1C2CCC
nc2cc1Cl
1C2Cc3ccc
n4cccc4
##2c3
##sc4ccccc4
N1C1CCCCC1
CCN4CC
c1ccccc1CN
NCCc2cccc
Cn1nc2c
Nc1c2ccccc2
NC2CCCCCCC2
N2Cc1ccccc1
cn2cc
ccc1CO
C1Nc2ccccc2C1
C2CCOC2
COc1ccc2nc3c
CCC3CCCCC3
nnc2s1
NCc2cccc3ccccc23
C1CC2C
nccc3c2
N1CCOc2ccc
CCCCCSc1nc
nc3ncnn23
Ca
##P1
CCC2CCN
c1ccoc1C
c1ccnnc1
ccc1CC2
C45CC6CC
##N1CCCC
##c3ncn4
n1C1CCCCC1
C5CCOCC5
CCCCCCCCCCCCCCCCNC
CC1C2C
1CCCc2cccnc21
1CCN2C
c2nc3scc
##nc1CNC
c1nnnn1Cc1ccc
##CN1CCCN
OC4CCCC4
##4cccnc34
ccc2N2CCN
NN2c2ccc
CNCCCCCCN
Cc2nccs2
c1C1CCCC
Cc6c
Cc1occc1
CCCCC1CCSS1
3c2ccc
Oc5cc
c2ccccc2c
##n2ncc
##c2ccccc2O1
##CCCN3CC
C34C
c5O
c3cnc4cc
NN12
NN1CCCCC1
##N1CCCCCC1
ncc2C1
ccc4C3
OC1CC2
cnc2C1
NCc2ccccc2OC
Oc3ccccc3C
CN4CCC3CC4
cnc3N
Cn1ncc2cc
NC3CCNCC3
c2sccc21
c5nc6cc
NCN2c1ccccc1
Sc3nnc
##2cccc
##8c
CC2NCC
n2ccccc12
CNC5
2Cc3ccccc3
nc2Cl
ccc3N2C
CN1CCCCCC1
COc1ccccc1F
ncn4
4C4
CCCO1
OCCN3
CCC23
Nc3cccc4
CC1Cc2cc
NCC2O
cc3c2n1
c2sc3ccc
Cn1ccc2ccc
##oc2c1C
##4CCNCC4
Nc1cnc2ccccc2c1
Nc2cnc3
##NC3CC3
Nc1cnccn1
OC1CN2CCC1CC2
41
OH
Sc3nc
oc2cccc
##SCC2
CNc3ccccc3
C2c3cc
cc3CC2
##CCOc1cccc
##c2cc3ccccc3
CCCCc3ccccc3
NCC5
N3S
ccc1N1CCCCC1
##CC3CN
CC4CCOCC4
SCCS2
OCCOc1ccc
C1NCC2
##3ccccc3c12
N3CCc4cc
cccc1C3
NCc3ccccc3OC
Cc2cnc3nc
10ccc
c2ccc3nccnc3c2
CSc1nc2ccccc2s1
ccnc2cc1OCCCN1CCOCC1
##n3cccc23
13CC
NOC2
Oc1nc2c
Sc1nc2cc
COc3c
cc2OCC
n1c2c
##c4cnc
##n3nn
CC3CCN
Cc1csc2c
Nc2nc3
Cc2ccccc2N
N1CCNC
##N1CC2
Cc2cccc3
OCCCF
CCOc1ccccc1CN
c3ccc4ncccc4c3
COc1cc2ncc3c
CNc1ncnc2c1ncn2
CCCCCCCCCCCCCCCCOC
nn1Cc1ccccc1
CCCn1c2c
1cccc2cc
CSc2nc3ccccc3s2
##6ccccc6c5
##c8c6
24C
##nc3ccccc3
c1ccccc1OC2
##CCCN3C
ccc2CC3
c1cn2c3c
nc2n1C
n3c1
##c2c1cnn2
ccc1OCCCC
Nc2ccccc2N1C
c2CO1
C1Nc2ccccc2C
c2cccnc2n
n2ncnc2
Nc3ncccc3
##sccc2C1
1CCN2CC
n3cnc4ccccc43
CN4CCCC
CNCCc1ccc
C1c1cccs1
##c2nc3ccccc3nc21
Cn1cnc2ccc
10C
cc2c1OCCN
4CCC5
ncnc3s2
sc3ncnc
##N2CCC
CNc2nccc
##CCCCCCCN
C2c3cccc
CC2CC3
n2CCN1C
COC5
##n3c4ccccc4
c2coc3c
CNC2CC
OCCn1c
##CC3C2
cccc6
2CCCCN2
c2ccc3cccc
cc1Oc1ccccc1
##ncc34
##4ccccc4cc
OCCCN2CCOCC2
c1ncco1
##c1nc2ccccc2nc1
nc2cc1
cc1S2
5C4
##CCS2
C4COC4
Cc1cc2n
CCn1ncc2c
c2occc12
46OO5
Nn1cnnc1
ONC
##n1c2ccccc2
CCNCCC
1Cl
CSc2nc3ccc
cc4oc
1CCc2ccccc2N
ccc1OS
##n2Cc1ccccc1
sc2Cl
sc2c1CCC
##cnccc2n1
##c1ncnc2c1cnn2
c2cc3ncn
